**Pandas库理解**
* 两个数据类型：Series,DataFrame
* 基于上述数据类型的各类操作   基本操作、运算操作、特征类操作、关联类操作

DataFrame
* 索引时先index后column （先行后列）
* 添加时先column后index （先列后行）

In [20]:
import pandas as pd
import numpy as np

from IPython.core.interactiveshell import InteractiveShell 
InteractiveShell.ast_node_interactivity = "all"

|NumPy|Pandas|
|--|--|
|基础数据类型|拓展数据类型|
|关注数据的结构表达|关注数据的应用表达|
|维度：数据间关系|数据与索引间关系|

## Pandas库的DataFrame类型


* DataFrame类型有共用相同索引的一组列组成

index_0----> data_a data_1     data_w 
index_1----> data_b data_2     data_x
index_2----> data_c data_3 .... data_y
index_3----> data_d data_4     data_z
 索引              多列数据

* DataFrame是一个表格型的数据类型，每列值类型可以不同
* DataFrame既有行索引、也有列索引
* DataFrame常用于表达二维数据，但可以表达多维数据

### 创建
**DataFrame类型有如下类型创建**
* 二维ndarray对象
* 由一维ndarray、列表、字典、元组或Series构成的字典
* Series类型
* 其他的DataFrame类型

* *二维ndarray对象创建*

In [1]:
import pandas as pd
import numpy as np
d=pd.DataFrame(np.arange(10).reshape(2,5))
print(d)

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

* *从一维ndarray对象字典创建*

In [3]:
dt={"one":pd.Series([1,2,3],index=['a','b','c'])\
   ,'two':pd.Series([9,8,7,6],index=['a','b','c','d'])}
d=pd.DataFrame(dt)
print(d)   #自定义行索引，自定义列索引

   one  two
a  1.0    9
b  2.0    8
c  3.0    7
d  NaN    6

In [4]:
pd.DataFrame(dt,index=['b','c','d'],\
             columns=['two','three'])  #数据根据行列索引自动补齐

   two three
b    8   NaN
c    7   NaN
d    6   NaN

* *从列表类型的字典创建*

In [5]:
d1={'one':[1.0,2.0,3.0],'two':[9,-5,8]}
d=pd.DataFrame(d1,index=['a','b','c'])
print(d)

   one  two
a  1.0    9
b  2.0   -5
c  3.0    8

In [6]:
d2={'城市':['北京','上海','广州','深圳','沈阳'],
    '环比':[101.5,101.2,101.3,102.0,100.1],
    '同比':[120.7,127.3,119.4,140.9,101.4],
    '定基':[121.4,127.8,120.0,145.5,101.6]}
d=pd.DataFrame(d2,index=['c1','c2','c3','c4','c5'])
print(d)

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c5  沈阳  100.1  101.4  101.6

In [7]:
print(d.index)
print(d.columns)
print(d.values)

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')
Index(['城市', '环比', '同比', '定基'], dtype='object')
[['北京' 101.5 120.7 121.4]
 ['上海' 101.2 127.3 127.8]
 ['广州' 101.3 119.4 120.0]
 ['深圳' 102.0 140.9 145.5]
 ['沈阳' 100.1 101.4 101.6]]

In [8]:
print(d['城市'])

c1    北京
c2    上海
c3    广州
c4    深圳
c5    沈阳
Name: 城市, dtype: object

In [9]:
print(d.ix['c2'])

城市       上海
环比    101.2
同比    127.3
定基    127.8
Name: c2, dtype: object

D:\programs\code\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [10]:
print(d['同比']['c3'])

119.4

DataFrame是二维带“标签”数组
DataFrame基本操作类似Series，依据行列索引

## Pandas库的数据类型操作
> 数据类型操作--->如何改变Sereis和DataFrame对象?

#### 丢弃指定轴上的选项
> drop

In [15]:
obj = pd.Series(np.arange(5.),index=['a','b','c','d','e'])
print(obj)
print('\n')

obj2 = obj.drop('c')
print(obj2)
print('\n')

obj3 = obj.drop(['d','c'])
print(obj3)

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64


a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64


a    0.0
b    1.0
e    4.0
dtype: float64

In [16]:
data = pd.DataFrame(np.arange(16).reshape(4,4),\
                   index=['Ohio','Colorado','Utah','New York'],\
                   columns=['one','two','three','four'])
print(data)
print('\n')

data2 = data.drop(['Colorado','Ohio'])  #用标签序列调用drop会从 行标签(axis0) 删除值
print(data2)
print('\n')

data3 = data.drop('two',axis=1)
print(data3)
print('\n')

data4=data.drop(['two','four'],axis='columns')
print(data4)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15


          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15


          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15


          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

> 许多函数，如drop，可以就地修改对象，修改Series或DataFrame的大小和形状，不会返回新的对象。使用**inplace**，会销毁被删除的数据

In [17]:
obj.drop('c',inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

# 索引和数据选择

## 索引、选取和过滤

### Series索引

* Series的索引类似于NumPy数组的索引，只不过Series的索引值不只是整数

In [18]:
obj = pd.Series(np.arange(4.),index=['a','b','c','d'])
print(obj)

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [19]:
obj['b']

1.0

In [20]:
obj[1]

1.0

In [21]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [22]:
obj[['b','a','c']]

b    1.0
a    0.0
c    2.0
dtype: float64

In [23]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [24]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

> 利用标签的切片运算与普通的python切片运算不同，其末端是包含的

In [25]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

### DateFrame索引

* 用一个**值或序列**对DataFrame进行索引,其实就是获取一个或多个**列**

In [26]:
data = pd.DataFrame(np.arange(16).reshape(4,4),\
                   index=['Ohio','Colorado','Utah','New York'],\
                   columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [28]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

### 特殊情况[切片+布尔型]

> 特殊情况：1.通过**切片或布尔型数组**选取数据

In [29]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [30]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### 布尔索引

> 2.通过**布尔型DataFrame**进行索引

In [31]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [32]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### ``isin()``

> ``Series对象``:Series元素存在于**传递列表**中，该向量为真

In [3]:
s = pd.Series(np.arange(5), index=np.arange(5)[::-1], dtype='int64')
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [4]:
s.isin([2, 4, 6])

4    False
3    False
2     True
1    False
0     True
dtype: bool

In [5]:
s[s.isin([2, 4, 6])]

2    2
0    4
dtype: int64

> ``Index对象``：可以使用同样方法，判断哪些搜索标签实际存在

In [6]:
s[s.index.isin([2, 4, 6])]

4    0
2    2
dtype: int64

In [8]:
# compare another method
s.reindex([2,3,6])

2    2.0
3    1.0
6    NaN
dtype: float64

> ``MultiIndex``:检查选择单独级别

In [14]:
s_mi = pd.Series(np.arange(6),
   .....:                  index=pd.MultiIndex.from_product([[0, 1], ['a', 'b', 'c']]))
s_mi

0  a    0
   b    1
   c    2
1  a    3
   b    4
   c    5
dtype: int32

In [16]:
s_mi.loc[s_mi.isin([(1,'a'),(2,'b'),(0,'c')])]
s_mi

0  a    0
   b    1
   c    2
1  a    3
   b    4
   c    5
dtype: int32

In [19]:
s_mi.loc[s_mi.index.isin(['a','c','e'],level=1)]

0  a    0
   c    2
1  a    3
   c    5
dtype: int32

> ``DataFrame``:调用isin()时，将一组值作为数组或字典传递。
* 如果values是一个数组，则isin返回与原始DataFrame形状相同的布尔数据框，并在元素序列中的任何位置使用True。

In [20]:
df = pd.DataFrame({'vals': [1, 2, 3, 4], 'ids': ['a', 'b', 'f', 'n'],
   .....:                    'ids2': ['a', 'n', 'c', 'n']})
df

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c
3     4   n    n

In [21]:
values = ['a','b',1,3]
df.isin(values)

    vals    ids   ids2
0   True   True   True
1  False   True  False
2   True  False  False
3  False  False  False

* 将某些值与某些列匹配
    * 只需将值设置dict为键为列的位置，值即为要检查的项目列表。

In [22]:
values = {'ids': ['a','b'],'ids2': ['a','n'],'vals': [1,3]}
df.isin(values)

    vals    ids   ids2
0   True   True   True
1  False   True   True
2   True  False  False
3  False  False   True

> 结合``any()``和``all()``方法快速选择符合给定的标准的行

In [32]:
df

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c
3     4   n    n

In [35]:
values = {'ids':['a','b'],'ids2':['a','c']}
row_mask = df.isin(values).any(1)
df[row_mask]

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c

In [39]:
values = {'vals':[1,3],'ids':['a','b'],'ids2':['a','c']}
row_mask = df.isin(values).all(1)   #axis=1(column)
df[row_mask]

   vals ids ids2
0     1   a    a

In [30]:
help(pd.DataFrame.all)

Help on function all in module pandas.core.frame:

all(self, axis=0, bool_only=None, skipna=True, level=None, **kwargs)
    Return whether all elements are True, potentially over an axis.

    Returns True if all elements within a series or along a Dataframe
    axis are non-zero, not-empty or not-False.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns', None}, default 0
        Indicate which axis or axes should be reduced.

        * 0 / 'index' : reduce the index, return a Series whose index is the
          original column labels.
        * 1 / 'columns' : reduce the columns, return a Series whose index is the
          original index.
        * None : reduce all axes, return a scalar.

    skipna : boolean, default True
        Exclude NA/null values. If an entire row/column is NA, the result
        will be NA.
    level : int or level name, default None
        If the axis is a MultiIndex (hierarchical), count along a
        particular level, collapsing into a Series.
    bool_only : boolean, default None
        Include only boolean columns. If None, will attempt to use everything,
        then use only boolean data. Not implemented for Series.
    **kwargs : any, default None
        Additional keywords have no effect but might be accepted for
        compatibility with NumPy.

    Returns
    -------
    all : Series or DataFrame (if level specified)

    See also
    --------
    pandas.Series.all : Return True if all elements are True
    pandas.DataFrame.any : Return True if one (or more) elements are True

    Examples
    --------
    Series

    >>> pd.Series([True, True]).all()
    True
    >>> pd.Series([True, False]).all()
    False

    DataFrames

    Create a dataframe from a dictionary.

    >>> df = pd.DataFrame({'col1': [True, True], 'col2': [True, False]})
    >>> df
       col1   col2
    0  True   True
    1  True  False

    Default behaviour checks if column-wise values all return True.

    >>> df.all()
    col1     True
    col2    False
    dtype: bool

    Specify ``axis='columns'`` to check if row-wise values all return True.

    >>> df.all(axis='columns')
    0     True
    1    False
    dtype: bool

    Or ``axis=None`` for whether every value is True.

    >>> df.all(axis=None)
    False

#### ``where()``

In [40]:
s = pd.Series(np.arange(5), index=np.arange(5)[::-1], dtype='int64')
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

> 保证输出与原始数据具有相同的形状

In [41]:
s.where(s>0)

4    NaN
3    1.0
2    2.0
1    3.0
0    4.0
dtype: float64

In [42]:
# compare
s[s>0]

3    1
2    2
1    3
0    4
dtype: int64

> ``DataFrame``

In [3]:
dates = pd.date_range(start='2020-01-01',periods=4)
df = pd.DataFrame(np.random.randn(4,3),index=dates,columns=['A','B','C'])
df

                   A         B         C
2020-01-01  0.178785  0.524261  0.737048
2020-01-02 -0.828883 -2.179864 -0.241172
2020-01-03  0.323754 -0.070245  0.945056
2020-01-04 -1.276304  1.185677 -0.102255

In [57]:
df.where(df < 0)

                   A         B         C
2020-01-01 -0.417324 -1.507187       NaN
2020-01-02       NaN       NaN -0.456474
2020-01-03       NaN -0.127198       NaN
2020-01-04 -0.474019       NaN -0.248272

In [58]:
df[df < 0]

                   A         B         C
2020-01-01 -0.417324 -1.507187       NaN
2020-01-02       NaN       NaN -0.456474
2020-01-03       NaN -0.127198       NaN
2020-01-04 -0.474019       NaN -0.248272

* **参数``other``：替换 条件为False 的值**

In [59]:
df.where(df < 0, -df)

                   A         B         C
2020-01-01 -0.417324 -1.507187 -0.485727
2020-01-02 -0.580470 -1.803634 -0.456474
2020-01-03 -0.638001 -0.127198 -1.262045
2020-01-04 -0.474019 -0.306770 -0.248272

* 根据布尔条件设置值

In [60]:
df2 = df.copy()
df2[df2 < 0] = 0
df2

                   A         B         C
2020-01-01  0.000000  0.000000  0.485727
2020-01-02  0.580470  1.803634  0.000000
2020-01-03  0.638001  0.000000  1.262045
2020-01-04  0.000000  0.306770  0.000000

In [61]:
df_orig = df.copy()
df_orig.where(df > 0, -df, inplace=True)
df_orig

                   A         B         C
2020-01-01  0.417324  1.507187  0.485727
2020-01-02  0.580470  1.803634  0.456474
2020-01-03  0.638001  0.127198  1.262045
2020-01-04  0.474019  0.306770  0.248272

* 对准

In [45]:
df2 = df.copy()
df2

df2.where(df2 > 0)

                   A         B         C
2020-01-01  0.178785  0.524261  0.737048
2020-01-02 -0.828883 -2.179864 -0.241172
2020-01-03  0.323754 -0.070245  0.945056
2020-01-04 -1.276304  1.185677 -0.102255

                   A         B         C
2020-01-01  0.178785  0.524261  0.737048
2020-01-02       NaN       NaN       NaN
2020-01-03  0.323754       NaN  0.945056
2020-01-04       NaN  1.185677       NaN

In [49]:
# 这种方法只能作用在内容上而不是轴上(类似于部分通过.locc设置)
df2[df2 > 0] = 3   #讲False的值设置为3
df2

                   A         B         C
2020-01-01  3.000000  3.000000  3.000000
2020-01-02 -0.828883 -2.179864 -0.241172
2020-01-03  3.000000 -0.070245  3.000000
2020-01-04 -1.276304  3.000000 -0.102255

In [48]:
# 作用在轴上
df2 = df.copy()
df2.where(df2 > 0, df2['A'], axis='index')  #为False的值用df['A']代替（按index对准A列）

df2.where(df2 > 0, df2.loc['2020-01-03'], axis='columns')   #为False的值用df['A']代替（按columns对准A列）

                   A         B         C
2020-01-01  0.178785  0.524261  0.737048
2020-01-02 -0.828883 -0.828883 -0.828883
2020-01-03  0.323754  0.323754  0.945056
2020-01-04 -1.276304  1.185677 -1.276304

                   A         B         C
2020-01-01  0.178785  0.524261  0.737048
2020-01-02  0.323754 -0.070245  0.945056
2020-01-03  0.323754 -0.070245  0.945056
2020-01-04  0.323754  1.185677  0.945056

In [58]:
# 这两种方法等价
df2 = df.copy()
df2.where(df2 > 0, df2['A'], axis='index')  #为False的值用df['A']代替（按index对准A列）

df2.apply(lambda x,y: x.where(x>0, y), y=df['A'], axis=0)  #lambda传入了两个函数

                   A         B         C
2020-01-01  0.178785  0.524261  0.737048
2020-01-02 -0.828883 -0.828883 -0.828883
2020-01-03  0.323754  0.323754  0.945056
2020-01-04 -1.276304  1.185677 -1.276304

                   A         B         C
2020-01-01  0.178785  0.524261  0.737048
2020-01-02 -0.828883 -0.828883 -0.828883
2020-01-03  0.323754  0.323754  0.945056
2020-01-04 -1.276304  1.185677 -1.276304

* other参数可以是callable

In [31]:
df3 = pd.DataFrame({'A': [1, 2, 3],
   .....:                     'B': [4, 5, 6],
   .....:                     'C': [7, 8, 9]})
df3

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [33]:
df3.where(lambda x: x>4)

df3.where(lambda x: x>4,lambda x: x+10)  #为False的值用other代替

    A    B  C
0 NaN  NaN  7
1 NaN  5.0  8
2 NaN  6.0  9

    A   B  C
0  11  14  7
1  12   5  8
2  13   6  9

##### mask

> 反布尔运算where

In [68]:
s = pd.Series(np.arange(5), index=range(5)[::-1])
s

s.mask(s >= 0)

4    0
3    1
2    2
1    3
0    4
dtype: int32

4   NaN
3   NaN
2   NaN
1   NaN
0   NaN
dtype: float64

In [69]:
df

df.mask(df >= 0)

                   A         B         C
2020-01-01  0.178785  0.524261  0.737048
2020-01-02 -0.828883 -2.179864 -0.241172
2020-01-03  0.323754 -0.070245  0.945056
2020-01-04 -1.276304  1.185677 -0.102255

                   A         B         C
2020-01-01       NaN       NaN       NaN
2020-01-02 -0.828883 -2.179864 -0.241172
2020-01-03       NaN -0.070245       NaN
2020-01-04 -1.276304       NaN -0.102255

#### examle

In [71]:
dates = pd.date_range('1/1/2000',periods=8)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [72]:
df = pd.DataFrame(np.random.randn(8,4),index=dates,columns=['A','B','C','D'])
df

                   A         B         C         D
2000-01-01  2.084570  0.144663  0.471883 -0.658732
2000-01-02  0.530131  0.636511  0.409362 -1.678036
2000-01-03 -0.519173 -0.616866 -0.166787  2.619146
2000-01-04  0.153859  1.113543 -1.072652  0.436338
2000-01-05  1.214448 -0.901782 -0.107845  0.360723
2000-01-06  0.023587  1.673387 -0.382354 -0.179313
2000-01-07 -1.531624 -0.713454 -0.276061  0.155361
2000-01-08 -0.807686 -0.029051  2.018296  0.056551

In [73]:
dates[5]

Timestamp('2000-01-06 00:00:00', freq='D')

In [77]:
s = df['A']
s

2000-01-01    2.084570
2000-01-02    0.530131
2000-01-03   -0.519173
2000-01-04    0.153859
2000-01-05    1.214448
2000-01-06    0.023587
2000-01-07   -1.531624
2000-01-08   -0.807686
Freq: D, Name: A, dtype: float64

In [79]:
s[dates[5]]

0.023586701942771633

## 用loc和iloc进行选取
* loc iloc对selct & setting都适用

### 切片范围

> Series切片，语法与ndarry完全一样

In [130]:
s = pd.Series([2,4,0,1,9],index=list('abcde'))
s

a    2
b    4
c    0
d    1
e    9
dtype: int64

In [131]:
s[:5]

a    2
b    4
c    0
d    1
e    9
dtype: int64

In [132]:
s[::2]

a    2
c    0
e    9
dtype: int64

In [133]:
s[::-1]

e    9
d    1
c    0
b    4
a    2
dtype: int64

> DataFrame内部切片

In [33]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data[:2]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7

In [116]:
data[::-1]

          one  two  three  four
New York   12   13     14    15
Utah        8    9     10    11
Colorado    0    5      6     7
Ohio        0    0      0     0

> 对设置也适用

In [117]:
data2 = data.copy()
data2[:2] = 0
data2

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    0      0     0
Utah        8    9     10    11
New York   12   13     14    15

### 按标签访问 [loc]

In [34]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [36]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [37]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

> 这两个索引函数也适用于一个标签或多个标签的切片

In [38]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [39]:
data.iloc[:,:3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [111]:
data[::-2]

          one  two  three  four
New York   12   13     14    15
Colorado    0    5      6     7

In [40]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

> 通过整数列表选择

In [109]:
data.iloc[[0,2],[0,3]]

      one  four
Ohio    0     0
Utah    8    11

## 方法汇总

**DataFrame选取和重新组合数据的方法**

|类型|说明|
|-|-|
|df[val]| |
|df.loc[val]| |
|df.loc[:,val]| |
|df.loc[val1,val2]| |
|df.iloc[where]| |
|df.iloc[:,where] | |
|df.iloc[where_i,where_j] |通过整数位置，同时选取行和列 |
|df.at[label_i,label_j] |通过行和列标签，选取单一的标量 |
|df.iat[i,j] | |
|reindex |通过标签选取行或列 |
|get_value,set_value |通过行和列标签选取单一值 |

In [49]:
data.iat[1,2]

6

##### 索引类型的常用方法
|方法|说明|
|--|--|
|.append(idx)|连接另一个Index对象，产生新的Index对象|
|.diff(idx)|计算差集，产生新的Index对象|
|.intersection(idx)|计算交集|
|.union(idx)|计算并集|
|.delete(loc)|删除loc位置处的元素|
|.insert(loc,e)|在loc位置增加一个元素e|

In [42]:
d

       环比     同比  城市     定基
c5  100.1  101.4  沈阳  101.6
c4  102.0  140.9  深圳  145.5
c3  101.3  119.4  广州  120.0
c2  101.2  127.3  上海  127.8
c1  101.5  120.7  北京  121.4

In [59]:
nc = d.columns.delete(0)
nc

Index(['同比', '城市', '定基'], dtype='object')

In [61]:
ni = d.index.insert(5,'c0')
ni

Index(['c5', 'c4', 'c3', 'c2', 'c1', 'c0'], dtype='object')

In [62]:
nd = d.reindex(index=ni,columns=nc)
nd

       同比   城市     定基
c5  101.4   沈阳  101.6
c4  140.9   深圳  145.5
c3  119.4   广州  120.0
c2  127.3   上海  127.8
c1  120.7   北京  121.4
c0    NaN  NaN    NaN

In [65]:
nd=d.reindex(index=ni,columns=nc,fill_value='missing')
nd

         同比       城市       定基
c5    101.4       沈阳    101.6
c4    140.9       深圳    145.5
c3    119.4       广州      120
c2    127.3       上海    127.8
c1    120.7       北京    121.4
c0  missing  missing  missing

## 属性访问

* series  
> access an index directly as an attribute

In [87]:
sa = pd.Series([1,2,3],index=list('abc'))
sa

a    1
b    2
c    3
dtype: int64

In [85]:
sa.b

2

In [90]:
sa.a = 5
sa

a    5
b    2
c    3
dtype: int64

* DataFrame
> access a column directly as an attribute

In [89]:
dfa = df.copy()
dfa

                   A         B         C         D
2000-01-01  2.084570  0.144663  0.471883 -0.658732
2000-01-02  0.530131  0.636511  0.409362 -1.678036
2000-01-03 -0.519173 -0.616866 -0.166787  2.619146
2000-01-04  0.153859  1.113543 -1.072652  0.436338
2000-01-05  1.214448 -0.901782 -0.107845  0.360723
2000-01-06  0.023587  1.673387 -0.382354 -0.179313
2000-01-07 -1.531624 -0.713454 -0.276061  0.155361
2000-01-08 -0.807686 -0.029051  2.018296  0.056551

In [86]:
dfa.A

2000-01-01    2.084570
2000-01-02    0.530131
2000-01-03   -0.519173
2000-01-04    0.153859
2000-01-05    1.214448
2000-01-06    0.023587
2000-01-07   -1.531624
2000-01-08   -0.807686
Freq: D, Name: A, dtype: float64

In [93]:
dfa.A = list(range(len(dfa.index)))   # ok if A already exists
dfa

            A         B         C         D
2000-01-01  0  0.144663  0.471883 -0.658732
2000-01-02  1  0.636511  0.409362 -1.678036
2000-01-03  2 -0.616866 -0.166787  2.619146
2000-01-04  3  1.113543 -1.072652  0.436338
2000-01-05  4 -0.901782 -0.107845  0.360723
2000-01-06  5  1.673387 -0.382354 -0.179313
2000-01-07  6 -0.713454 -0.276061  0.155361
2000-01-08  7 -0.029051  2.018296  0.056551

In [94]:
dfa['E'] = list(range(len(dfa.index)))   # use this form to create a new column
dfa

            A         B         C         D  E
2000-01-01  0  0.144663  0.471883 -0.658732  0
2000-01-02  1  0.636511  0.409362 -1.678036  1
2000-01-03  2 -0.616866 -0.166787  2.619146  2
2000-01-04  3  1.113543 -1.072652  0.436338  3
2000-01-05  4 -0.901782 -0.107845  0.360723  4
2000-01-06  5  1.673387 -0.382354 -0.179313  5
2000-01-07  6 -0.713454 -0.276061  0.155361  6
2000-01-08  7 -0.029051  2.018296  0.056551  7

> assign **dict** to **a row** of a DataFrame

In [96]:
x = pd.DataFrame({'x':[1,2,3],'y':[3,4,5]})
x

   x  y
0  1  3
1  2  4
2  3  5

In [99]:
x.iloc[1] = {'x':9,'y':99}
x

   x   y
0  1   3
1  9  99
2  3   5

* **警告**
    * 1、当index是有效的python标识符才可以使用此属性访问权限  e.g  s.1不允许
    * 2、属性与现有方法名冲突则不可使用  e.g  s.min不允许
    * 3、同样的  与index, major_axis, minor_axis, items冲突不允许
    * 4、可以使用标准索引访问  e.g s['1']  s['min']  s['index']可以

* 通过属性可以修改Series/DataDrame，但``创建新列``时**不要使用属性方式**，使用``标准索引``创建新列

In [101]:
df = pd.DataFrame({'one':[1.,2.,3.]})
df.two = [4,5,6]
df

D:\programs\code\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access

   one
0  1.0
1  2.0
2  3.0

In [102]:
df['two'] = [4,5,6]
df

   one  two
0  1.0    4
1  2.0    5
2  3.0    6

## select by callable

* .loc，.iloc以及[]索引可以接受一个callable索引器

In [4]:
df1 = pd.DataFrame(np.random.randn(6, 4),
   ....:                    index=list('abcdef'),
   ....:                    columns=list('ABCD'))
df1

          A         B         C         D
a -1.259429 -1.125539  0.208746 -0.395391
b -1.223358 -1.525567  0.013761 -0.916810
c -0.553068 -0.167626 -3.060856  1.467099
d  0.813404 -0.470255  0.474222 -1.365711
e -0.780033  1.618878  0.766849 -0.167930
f  3.488765  0.323027  2.185007  0.230406

In [21]:
df1[lambda df: df.columns[0]]

a   -1.259429
b   -1.223358
c   -0.553068
d    0.813404
e   -0.780033
f    3.488765
Name: A, dtype: float64

In [31]:
df1.loc[lambda df : df.loc[:,'A'] > 0,:]

          A         B         C         D
d  0.813404 -0.470255  0.474222 -1.365711
f  3.488765  0.323027  2.185007  0.230406

In [32]:
df1.iloc[:2,lambda df: [0,1]]

          A         B
a -1.259429 -1.125539
b -1.223358 -1.525567

> use callable indexing in ``Series``

In [22]:
df1['A'].loc[lambda s: s>0]

d    0.813404
f    3.488765
Name: A, dtype: float64

## 不推荐使用``缺少标签``*(不存在的索引)*的列表进行索引

> 在以前的版本中，``.loc[list-of-labels]``只要找到至少1个密钥，使用就可以工作（否则会引起a KeyError）。不推荐使用此行为，并将显示指向此部分的警告消息。推荐的替代方案是使用``.reindex()``

In [33]:
s = pd.Series([1, 2, 3])
s

0    1
1    2
2    3
dtype: int64

### 重新索引``.reindex()``

In [38]:
# s.loc[[1, 2,3]]报错
s.reindex([1,2,3])

1    2.0
2    3.0
3    NaN
dtype: float64

> ``使用有效的索引``

In [48]:
# 一种惯用且有效的方法；保留选择的dtype
labels = [1,2,3]
s.loc[s.index.intersection(labels)]   #取s的索引和labels索引的交集
                                            #即取labels中存在于s索引中的那些索引

1    2
2    3
dtype: int64

> ``(源数据)拥有重复索引``时，使用``.reindex()``会报错

In [62]:
s = pd.Series(np.arange(4), index=['a','a','b','c'])
labels = ['c','d']
s

a    0
d    1
b    2
c    3
dtype: int32

In [63]:
# s.reindex(labels)
# 报错:cannot reindex from a duplicate axis

c    3
d    1
dtype: int32

* 解决方法：将所需标签与当前轴相交，然后重新索引

In [59]:
s.loc[s.index.intersection(labels)].reindex(labels)

c    3.0
d    NaN
dtype: float64

* 如果``生成的索引``(labels)重复，仍然会报错

In [61]:
labels = ['a','d']  # s中有两个'a'索引
# s.loc[s.index.intersection(labels)].reindex(labels)
# 报错： cannot reindex from a duplicate axis

> ``.reindex()``介绍

* .reindex()能够改变或重排Series和DataFrame索引

In [11]:
print(d)
d=d.reindex(index=['c5', 'c4', 'c3', 'c2', 'c1'])
d

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c5  沈阳  100.1  101.4  101.6

    城市     环比     同比     定基
c5  沈阳  100.1  101.4  101.6
c4  深圳  102.0  140.9  145.5
c3  广州  101.3  119.4  120.0
c2  上海  101.2  127.3  127.8
c1  北京  101.5  120.7  121.4

In [12]:
d=d.reindex(columns=['环比','同比','城市','定基'])
d

       环比     同比  城市     定基
c5  100.1  101.4  沈阳  101.6
c4  102.0  140.9  深圳  145.5
c3  101.3  119.4  广州  120.0
c2  101.2  127.3  上海  127.8
c1  101.5  120.7  北京  121.4

> **插值处理**：对于时间序列这样的有序数据，重新索引时可以插值处理。**method**选项可以达到此目的，例如，使用ffill可以实现前向值填充

In [13]:
obj = pd.Series(['blue','purple','yellow'],index=[0,2,4])

obj.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

* .reindex(index=None,columns=None,...)的参数

|参数|说明|
|--|--|
|index,columns|新的行列自定义索引|
|fill_value|重新索引中，用于填充缺失位置的值|
|method|填充方法，ffill当前值向前填充，bfill向后填充|
|limit|最大填充量|
|copy|默认True,生成新的对象，False是，新旧相等不重复|

In [14]:
newc=d.columns.insert(4,'新增')
newd=d.reindex(columns=newc,fill_value=200)
newd

       环比     同比  城市     定基   新增
c5  100.1  101.4  沈阳  101.6  200
c4  102.0  140.9  深圳  145.5  200
c3  101.3  119.4  广州  120.0  200
c2  101.2  127.3  上海  127.8  200
c1  101.5  120.7  北京  121.4  200

* 索引类型
    * Series和DataFrame的索引是Index类型，**Index对象是不可修改类型**

## ``query()``方法

> 允许使用**表达式**继续选择

In [74]:
df = pd.DataFrame(np.random.randn(8,3), columns=list('abc'))
df

          a         b         c
0  0.268239  1.619676 -0.883678
1 -0.576747  0.829610 -0.711779
2  0.305338  1.484787 -1.192144
3  0.473262  1.289428  1.375656
4  0.681798 -0.805196  0.356253
5 -1.573165  0.300595  1.894874
6 -0.684916 -0.678752  0.316799
7  1.132865  0.321019  0.969605

In [77]:
#pure python
df[(df.a < df.b) & (df.b<df.c)]

# query
df.query('a < b < c')

          a         b         c
3  0.473262  1.289428  1.375656
5 -1.573165  0.300595  1.894874
6 -0.684916 -0.678752  0.316799

          a         b         c
3  0.473262  1.289428  1.375656
5 -1.573165  0.300595  1.894874
6 -0.684916 -0.678752  0.316799

> 如果没有columns名称为'a'的，有Index名称为'a'，则会索引index

In [88]:
df = pd.DataFrame(np.random.randint(8, size=(4,2)), columns=list('bc'))  #生成size为(10,2),值不超过8的随机整数
df

df.index.name = 'a'
df

   b  c
0  5  0
1  2  6
2  2  5
3  4  2

   b  c
a
0  5  0
1  2  6
2  2  5
3  4  2

In [89]:
df.query(' a < b and b < c')

   b  c
a
1  2  6

> Index没有名称，但希望索引Index。在查询表达式种使用'index'

In [90]:
df.query('index < b < c')

   b  c
a
1  2  6

* **注意**
    * Index名和columns名重叠，column名称优先

In [93]:
df = pd.DataFrame({'a': np.random.randint(5,size=5)})
df

df.index.name = 'a'
df

df.query('a > 2')

   a
0  3
1  0
2  2
3  3
4  1

   a
a
0  3
1  0
2  2
3  3
4  1

   a
a
0  3
3  3

* index有名称时，依然可以在查询表达式种使用'index'

In [94]:
df.query('index > 2')

   a
a
3  3
4  1

### MultiIndex的query()用法

### 与python语法比较

> 比较运算符比``&``和更紧``|``

* python中，``&`` ``| ``比比较运算符更紧

In [98]:
df = pd.DataFrame(np.random.randint(8, size=(6, 3)), columns=list('abc'))
df

   a  b  c
0  4  7  7
1  0  3  7
2  3  1  0
3  6  6  5
4  5  4  1
5  4  5  5

In [99]:
df.query(' a<b & b<c')

   a  b  c
1  0  3  7

> 使用英语

In [100]:
df.query('a < b and b < c')

   a  b  c
1  0  3  7

> 接近于在纸上书写的方式

In [101]:
df.query('a < b <ｃ')

   a  b  c
1  0  3  7

### 使用``in``和`not in``

In [102]:
 df = pd.DataFrame({'a': list('aabbccddeeff'), 'b': list('aaaabbbbcccc'),
   .....:                    'c': np.random.randint(5, size=12),
   .....:                    'd': np.random.randint(9, size=12)})
df

    a  b  c  d
0   a  a  0  7
1   a  a  1  6
2   b  a  0  7
3   b  a  1  2
4   c  b  4  3
5   c  b  3  8
6   d  b  1  4
7   d  b  2  1
8   e  c  2  8
9   e  c  0  4
10  f  c  4  2
11  f  c  2  1

In [105]:
df.query('a in b')

# How you'd do it in pure Python
df[df.a.isin(df.b)]

   a  b  c  d
0  a  a  0  7
1  a  a  1  6
2  b  a  0  7
3  b  a  1  2
4  c  b  4  3
5  c  b  3  8

   a  b  c  d
0  a  a  0  7
1  a  a  1  6
2  b  a  0  7
3  b  a  1  2
4  c  b  4  3
5  c  b  3  8

In [106]:
df.query('a not in b')

# pure Python
df[~df.a.isin(df.b)]

    a  b  c  d
6   d  b  1  4
7   d  b  2  1
8   e  c  2  8
9   e  c  0  4
10  f  c  4  2
11  f  c  2  1

    a  b  c  d
6   d  b  1  4
7   d  b  2  1
8   e  c  2  8
9   e  c  0  4
10  f  c  4  2
11  f  c  2  1

> 与其他表达式结合使用

In [108]:
df.query('a in b and c < d')

# pure python
df[df.a.isin(df.b) & (df.c < df.d)]

   a  b  c  d
0  a  a  0  7
1  a  a  1  6
2  b  a  0  7
3  b  a  1  2
5  c  b  3  8

   a  b  c  d
0  a  a  0  7
1  a  a  1  6
2  b  a  0  7
3  b  a  1  2
5  c  b  3  8

### ``==``运算符与``list``对象

> 比较list值使用＝＝／！＝，类似于使用in／not in

In [111]:
df.query('b == ["a","b","c"]')

# pure python
df[df.b.isin(['a','b','c'])]

    a  b  c  d
0   a  a  0  7
1   a  a  1  6
2   b  a  0  7
3   b  a  1  2
4   c  b  4  3
5   c  b  3  8
6   d  b  1  4
7   d  b  2  1
8   e  c  2  8
9   e  c  0  4
10  f  c  4  2
11  f  c  2  1

    a  b  c  d
0   a  a  0  7
1   a  a  1  6
2   b  a  0  7
3   b  a  1  2
4   c  b  4  3
5   c  b  3  8
6   d  b  1  4
7   d  b  2  1
8   e  c  2  8
9   e  c  0  4
10  f  c  4  2
11  f  c  2  1

In [123]:
# using list + !=
df.query('c != [1, 2]')

# using not in/ in 
df.query('c not in [1, 2]')
df.query('[1,2] not in c')

    a  b  c  d
0   a  a  0  7
2   b  a  0  7
4   c  b  4  3
5   c  b  3  8
9   e  c  0  4
10  f  c  4  2

    a  b  c  d
0   a  a  0  7
2   b  a  0  7
4   c  b  4  3
5   c  b  3  8
9   e  c  0  4
10  f  c  4  2

    a  b  c  d
0   a  a  0  7
2   b  a  0  7
4   c  b  4  3
5   c  b  3  8
9   e  c  0  4
10  f  c  4  2

In [124]:
# pure python
df[~df.c.isin([1, 2])]

    a  b  c  d
0   a  a  0  7
2   b  a  0  7
4   c  b  4  3
5   c  b  3  8
9   e  c  0  4
10  f  c  4  2

In [127]:
df.query('[1,2 not in c]')

   a  b  c  d
1  a  a  1  6
0  a  a  0  7

### not 布尔运算符

> 可以使用``not``或``~``运算符否定布尔表达式。

In [144]:
df = pd.DataFrame(np.random.rand(20, 3), columns=list('abc'))
df['bools'] = np.random.rand(len(df)) > 0.5
df

           a         b         c  bools
0   0.148147  0.688184  0.157382  False
1   0.974734  0.679558  0.033824   True
2   0.021454  0.996955  0.725796   True
3   0.672059  0.276571  0.574836  False
4   0.955004  0.374057  0.246331  False
5   0.503270  0.858507  0.683371  False
6   0.952696  0.702006  0.390205  False
7   0.588985  0.680489  0.864865  False
8   0.331807  0.730807  0.432636   True
9   0.743034  0.038047  0.148372   True
10  0.646119  0.498787  0.403476   True
11  0.126804  0.309548  0.436749  False
12  0.896067  0.214705  0.072891  False
13  0.077983  0.709585  0.612018   True
14  0.920962  0.264916  0.000789  False
15  0.982916  0.368081  0.333927  False
16  0.013739  0.639477  0.328187  False
17  0.778934  0.673565  0.719765   True
18  0.534648  0.925615  0.145973  False
19  0.192871  0.718320  0.876463   True

In [145]:
df.query('~bools')

df.query('not bools')

df.query('not bools') == df[~df.bools]

           a         b         c  bools
0   0.148147  0.688184  0.157382  False
3   0.672059  0.276571  0.574836  False
4   0.955004  0.374057  0.246331  False
5   0.503270  0.858507  0.683371  False
6   0.952696  0.702006  0.390205  False
7   0.588985  0.680489  0.864865  False
11  0.126804  0.309548  0.436749  False
12  0.896067  0.214705  0.072891  False
14  0.920962  0.264916  0.000789  False
15  0.982916  0.368081  0.333927  False
16  0.013739  0.639477  0.328187  False
18  0.534648  0.925615  0.145973  False

           a         b         c  bools
0   0.148147  0.688184  0.157382  False
3   0.672059  0.276571  0.574836  False
4   0.955004  0.374057  0.246331  False
5   0.503270  0.858507  0.683371  False
6   0.952696  0.702006  0.390205  False
7   0.588985  0.680489  0.864865  False
11  0.126804  0.309548  0.436749  False
12  0.896067  0.214705  0.072891  False
14  0.920962  0.264916  0.000789  False
15  0.982916  0.368081  0.333927  False
16  0.013739  0.639477  0.328187  False
18  0.534648  0.925615  0.145973  False

       a     b     c  bools
0   True  True  True   True
3   True  True  True   True
4   True  True  True   True
5   True  True  True   True
6   True  True  True   True
7   True  True  True   True
11  True  True  True   True
12  True  True  True   True
14  True  True  True   True
15  True  True  True   True
16  True  True  True   True
18  True  True  True   True

> 表达式可以任意复杂

In [150]:
# query
shorter = df.query('a < b < c and (not bools) or bools > 2') 
shorter

# pure python
longer = df[(df.a < df.b) & (df.b < df.c) & (~df.bools) | (df.bools > 2)]
longer

shorter == longer

           a         b         c  bools
7   0.588985  0.680489  0.864865  False
11  0.126804  0.309548  0.436749  False

           a         b         c  bools
7   0.588985  0.680489  0.864865  False
11  0.126804  0.309548  0.436749  False

       a     b     c  bools
7   True  True  True   True
11  True  True  True   True

## 删除重复值

> ``duplicated``: 返回一个布尔向量，其长度为行数，表示行是否重复

> ``drop_duplicates``: 删除重复的行

* keep='first' （默认值）：标记/删除重复项，第一次出现除外。
* keep='last'：标记/删除重复项，除了最后一次出现。
* keep=False：标记/删除所有重复项。

In [5]:
df = pd.DataFrame({'a': ['one', 'one', 'two', 'two', 'two', 'three', 'four'],
                    'b': ['x', 'y', 'x', 'y', 'x', 'x', 'x'],
                     'c': np.random.randn(7)})
df

       a  b         c
0    one  x  0.433900
1    one  y  1.273320
2    two  x -0.414086
3    two  y -0.867381
4    two  x -0.090561
5  three  x  2.512274
6   four  x -0.897195

In [10]:
df.duplicated('a')
df.duplicated('a',keep='first')
df.duplicated('a',keep='last')
df.duplicated('a',keep=False)

0    False
1     True
2    False
3     True
4     True
5    False
6    False
dtype: bool

0    False
1     True
2    False
3     True
4     True
5    False
6    False
dtype: bool

0     True
1    False
2     True
3     True
4    False
5    False
6    False
dtype: bool

0     True
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [12]:
df.drop_duplicates('a',keep='last')
df.drop_duplicates('a',keep=False)

       a  b         c
1    one  y  1.273320
4    two  x -0.090561
5  three  x  2.512274
6   four  x -0.897195

       a  b         c
5  three  x  2.512274
6   four  x -0.897195

> **传递列表**

In [14]:
df

       a  b         c
0    one  x  0.433900
1    one  y  1.273320
2    two  x -0.414086
3    two  y -0.867381
4    two  x -0.090561
5  three  x  2.512274
6   four  x -0.897195

In [13]:
df.duplicated(['a','b'])

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [16]:
df.drop_duplicates(['a','b'])

       a  b         c
0    one  x  0.433900
1    one  y  1.273320
2    two  x -0.414086
3    two  y -0.867381
5  three  x  2.512274
6   four  x -0.897195

> **按索引**删除重复项:使用``Index.duplicated``然后切片

In [17]:
df2 = pd.DataFrame({'a': np.arange(6),
                     'b': np.random.randn(6)},
                    index=['a', 'a', 'b', 'c', 'b', 'a'])
df2

   a         b
a  0  1.007380
a  1  0.530643
b  2  0.682149
c  3 -0.029691
b  4 -1.062732
a  5  0.460030

In [18]:
df2.index.duplicated()

array([False,  True, False, False,  True,  True])

In [21]:
df2[~df2.index.duplicated()]

df2[~df2.index.duplicated(keep='last')]

df2[~df2.index.duplicated(keep=False)]

   a         b
a  0  1.007380
b  2  0.682149
c  3 -0.029691

   a         b
c  3 -0.029691
b  4 -1.062732
a  5  0.460030

   a         b
c  3 -0.029691

## 类字典的``get()``方法

> Series

In [22]:
s = pd.Series([1,2,3], index=['a','b','c'])
s

a    1
b    2
c    3
dtype: int64

In [23]:
s.get('b')  # equivalent to s['a']

2

In [26]:
s.get('e',default=-1)

-1

> DataFrame

In [28]:
df

       a  b         c
0    one  x  0.433900
1    one  y  1.273320
2    two  x -0.414086
3    two  y -0.867381
4    two  x -0.090561
5  three  x  2.512274
6   four  x -0.897195

In [29]:
df.get('a')

0      one
1      one
2      two
3      two
4      two
5    three
6     four
Name: a, dtype: object

In [34]:
df.get('d',default=-1)

-1

## ``lookup()``方法

> 给定一系列行标签和列标签，提取一组值

In [41]:
dflookup = pd.DataFrame(np.random.rand(10, 4), columns = ['A', 'B', 'C', 'D'])
dflookup

          A         B         C         D
0  0.823627  0.203634  0.452232  0.696530
1  0.049140  0.485745  0.297001  0.223925
2  0.687032  0.661781  0.223713  0.236976
3  0.360071  0.205599  0.477907  0.720197
4  0.950339  0.352516  0.352530  0.410083
5  0.752000  0.500050  0.440159  0.887826
6  0.853253  0.115443  0.279816  0.856471
7  0.774835  0.887789  0.618283  0.290165
8  0.624950  0.395911  0.708816  0.740899
9  0.854815  0.087771  0.233243  0.764529

In [42]:
dflookup.lookup(list(range(0,10,2)),['B','C','A','B','D'])
# 选取(0,'B')(2,'C')(4,'A')(6,'B')(8,'D')位置的值

<ipython-input-42-61f5dbc27940>:1: FutureWarning: The 'lookup' method is deprecated and will beremoved in a future version.You can use DataFrame.melt and DataFrame.locas a substitute.
  dflookup.lookup(list(range(0,10,2)),['B','C','A','B','D'])

array([0.20363367, 0.22371298, 0.9503388 , 0.11544334, 0.74089935])

### `DataFrame.melt`

In [43]:
help(pd.DataFrame.melt)

Help on function melt in module pandas.core.frame:

melt(self, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None, ignore_index=True) -> 'DataFrame'
    Unpivot a DataFrame from wide to long format, optionally leaving identifiers set.

    This function is useful to massage a DataFrame into a format where one
    or more columns are identifier variables (`id_vars`), while all other
    columns, considered measured variables (`value_vars`), are "unpivoted" to
    the row axis, leaving just two non-identifier columns, 'variable' and
    'value'.

    Parameters
    ----------
    id_vars : tuple, list, or ndarray, optional
        Column(s) to use as identifier variables.
    value_vars : tuple, list, or ndarray, optional
        Column(s) to unpivot. If not specified, uses all columns that
        are not set as `id_vars`.
    var_name : scalar
        Name to use for the 'variable' column. If None it uses
        ``frame.columns.name`` or 'variable'.
    value_name : scalar, default 'value'
        Name to use for the 'value' column.
    col_level : int or str, optional
        If columns are a MultiIndex then use this level to melt.
    ignore_index : bool, default True
        If True, original index is ignored. If False, the original index is retained.
        Index labels will be repeated as necessary.

        .. versionadded:: 1.1.0

    Returns
    -------
    DataFrame
        Unpivoted DataFrame.

    See Also
    --------
    melt : Identical method.
    pivot_table : Create a spreadsheet-style pivot table as a DataFrame.
    DataFrame.pivot : Return reshaped DataFrame organized
        by given index / column values.
    DataFrame.explode : Explode a DataFrame from list-like
            columns to long format.

    Examples
    --------
    >>> df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
    ...                    'B': {0: 1, 1: 3, 2: 5},
    ...                    'C': {0: 2, 1: 4, 2: 6}})
    >>> df
       A  B  C
    0  a  1  2
    1  b  3  4
    2  c  5  6

    >>> df.melt(id_vars=['A'], value_vars=['B'])
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5

    >>> df.melt(id_vars=['A'], value_vars=['B', 'C'])
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5
    3  a        C      2
    4  b        C      4
    5  c        C      6

    The names of 'variable' and 'value' columns can be customized:

    >>> df.melt(id_vars=['A'], value_vars=['B'],
    ...         var_name='myVarname', value_name='myValname')
       A myVarname  myValname
    0  a         B          1
    1  b         B          3
    2  c         B          5

    Original index values can be kept around:

    >>> df.melt(id_vars=['A'], value_vars=['B', 'C'], ignore_index=False)
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5
    0  a        C      2
    1  b        C      4
    2  c        C      6

    If you have multi-index columns:

    >>> df.columns = [list('ABC'), list('DEF')]
    >>> df
       A  B  C
       D  E  F
    0  a  1  2
    1  b  3  4
    2  c  5  6

    >>> df.melt(col_level=0, id_vars=['A'], value_vars=['B'])
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5

    >>> df.melt(id_vars=[('A', 'D')], value_vars=[('B', 'E')])
      (A, D) variable_0 variable_1  value
    0      a          B          E      1
    1      b          B          E      3
    2      c          B          E      5

In [45]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                    'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

*  ``id_vars`` : tuple, list, or ndarray, optional Column(s) to use as identifier variables.
* ``value_vars`` : tuple, list, or ndarray, optionalColumn(s) to unpivot. If not specified, uses all columns that are not set as id_vars

In [46]:
df.melt(id_vars='A',value_vars=['B','C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [50]:
df.melt(id_vars='A',value_vars=['B','C'],var_name='B&C',value_name='B&C_value')

   A B&C  B&C_value
0  a   B          1
1  b   B          3
2  c   B          5
3  a   C          2
4  b   C          4
5  c   C          6

* ``ignore_index``：bool，默认为True
    * 如果为True，则忽略原始索引。如果为False，则保留原始索引。
    * 索引标签将根据需要重复。

In [53]:
df.melt(id_vars='A',value_vars=['B','C'],ignore_index=True)

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [55]:
df.melt(id_vars='A',value_vars=['B','C'],ignore_index=False)

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
0  a        C      2
1  b        C      4
2  c        C      6

## 索引对象

> pandas `Index`类及其子类可以视为实现有序的多集合。允许重复

> 创建索引

* 将一个list或其他序列传递给 Index

In [60]:
index = pd.Index(['e','d','a','b'])
index
'b' in index

Index(['e', 'd', 'a', 'b'], dtype='object')

True

* 传递`name`在索引中

In [62]:
index =  pd.Index(['e','d','a','b'],name='something')
index
index.name

Index(['e', 'd', 'a', 'b'], dtype='object', name='something')

'something'

* name设置之后将显示在控制台中

In [66]:
index = pd.Index(range(5), name='rows')
columns = pd.Index(['a','b','c'], name='cols')
df = pd.DataFrame(np.random.rand(5,3),index=index,columns=columns)
df 
df['a']

cols         a         b         c
rows
0     0.764480  0.306861  0.182745
1     0.930585  0.002317  0.795572
2     0.934509  0.575469  0.742718
3     0.361208  0.944391  0.408414
4     0.694389  0.872890  0.701511

rows
0    0.764480
1    0.930585
2    0.934509
3    0.361208
4    0.694389
Name: a, dtype: float64

### 设置元数据

> index索引大多数是"不可修改"的。但是可以使用`rename`\ `set_names` \ `set_levels` \ `set_codes` 去修改它的元数据(例如`name`)
* 默认返回的是副本 --> 使用inplace=True

In [67]:
ind = pd.Index([1, 2, 3])
ind.rename('apple')

Int64Index([1, 2, 3], dtype='int64', name='apple')

In [68]:
ind
ind.set_names(['apples'])

Int64Index([1, 2, 3], dtype='int64')

Int64Index([1, 2, 3], dtype='int64', name='apples')

In [69]:
ind.name = 'bob'
ind

Int64Index([1, 2, 3], dtype='int64', name='bob')

> 高级索引

* `level`参数

In [70]:
index = pd.MultiIndex.from_product([range(3), ['one', 'two']], names=['first', 'second'])
index

MultiIndex([(0, 'one'),
            (0, 'two'),
            (1, 'one'),
            (1, 'two'),
            (2, 'one'),
            (2, 'two')],
           names=['first', 'second'])

In [73]:
index.levels[1]
index.set_levels(['a','b'],level=1)

Index(['one', 'two'], dtype='object', name='second')

MultiIndex([(0, 'a'),
            (0, 'b'),
            (1, 'a'),
            (1, 'b'),
            (2, 'a'),
            (2, 'b')],
           names=['first', 'second'])

### 在index对象上操作

> 两个主要的操作：`union(|)` 和 `intersection(&）`
* `.difference()`
    * a-b

In [76]:
a=pd.Index(['c','b','a'])
b=pd.Index(['c','e','d'])
a | b
a & b
a.difference(b)  # a-b

<ipython-input-76-5b338195efd9>:3: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  a | b

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

<ipython-input-76-5b338195efd9>:4: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead
  a & b

Index(['c'], dtype='object')

Index(['a', 'b'], dtype='object')

* `union`在不同dtypes的索引之间执行时，必须将索引强制转换为公共dtype
    * e.g 在整数和浮点数据之间执行联合 -->  整数值将转换为float

In [80]:
idx1 = pd.Index([0, 1, 2])
idx2 = pd.Index([0.5, 1.5])
idx1.union(idx2)

Float64Index([0.0, 0.5, 1.0, 1.5, 2.0], dtype='float64')

> `symmetric_difference` 相当于 idx1.difference(idx2).union(indx2.difference(idx1))
* 返回出现在idx1或idx2中，但不同时出现在两个idx中的元素
    * a ^ b
    * (a-b) ∪ (b-a)

In [79]:
idx1 = pd.Index([1, 2, 3, 4])
idx2 = pd.Index([2, 3, 4, 5])
idx1.symmetric_difference(idx2)
idx1 ^ idx2

Int64Index([1, 5], dtype='int64')

<ipython-input-79-eb6ae5ffae88>:4: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead
  idx1 ^ idx2

Int64Index([1, 5], dtype='int64')

> **note:**来自设置操作的结果索引将按升序排序。

### 缺少值

> 即使Index可以保存缺失值（NaN），但如果您不想要任何意外结果，也应该**避免使用**
* 例如，某些操作会隐式排除缺失值。

> `Index.fillna`：使用指定的标量值填充缺失值

In [82]:
idx1 = pd.Index([1, np.nan, 3, 4])
idx1

Float64Index([1.0, nan, 3.0, 4.0], dtype='float64')

In [88]:
idx1.fillna(2)

Float64Index([1.0, 2.0, 3.0, 4.0], dtype='float64')

In [89]:
idx2 = pd.DatetimeIndex([pd.Timestamp('2011-01-01'),
                          pd.NaT,
                          pd.Timestamp('2011-01-03')])
idx2

DatetimeIndex(['2011-01-01', 'NaT', '2011-01-03'], dtype='datetime64[ns]', freq=None)

In [90]:
idx2.fillna(pd.Timestamp('2011-01-02'))

DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03'], dtype='datetime64[ns]', freq=None)

## 设置/重新索引

### 设置索引

> **`set_index()`**

In [91]:
data = pd.DataFrame({'a':['bar','bar','foo','foo'],'b':['one','two','one','two'],\
                     'c':['z','y','x','w'], 'd':[1.0,2.0,3.0,4.0]})
data

     a    b  c    d
0  bar  one  z  1.0
1  bar  two  y  2.0
2  foo  one  x  3.0
3  foo  two  w  4.0

* 传入列名或列名列表

In [92]:
indexed1 = data.set_index('c')
indexed1

     a    b    d
c
z  bar  one  1.0
y  bar  two  2.0
x  foo  one  3.0
w  foo  two  4.0

     a    b  c    d
0  bar  one  z  1.0
1  bar  two  y  2.0
2  foo  one  x  3.0
3  foo  two  w  4.0

In [94]:
indexed2 = data.set_index(['a','b'])
indexed2

         c    d
a   b
bar one  z  1.0
    two  y  2.0
foo one  x  3.0
    two  w  4.0

* 参数：`append`保持现有索引，并追加给列一个多指标

In [96]:
frame = data.set_index('c', append=True)
frame

       a    b    d
  c
0 z  bar  one  1.0
1 y  bar  two  2.0
2 x  foo  one  3.0
3 w  foo  two  4.0

* 参数：`drop`不删除索引列/就地添加索引（不创建新对象）

In [95]:
frame = data.set_index('c', drop=False)
frame

     a    b  c    d
c
z  bar  one  z  1.0
y  bar  two  y  2.0
x  foo  one  x  3.0
w  foo  two  w  4.0

In [97]:
data.set_index(['a','b'],inplace=True)
data

         c    d
a   b
bar one  z  1.0
    two  y  2.0
foo one  x  3.0
    two  w  4.0

### 重置索引

> `reset_index`：将DataFrame的列中设置一个简单的整数索引

In [100]:
data
data.reset_index()

         c    d
a   b
bar one  z  1.0
    two  y  2.0
foo one  x  3.0
    two  w  4.0

     a    b  c    d
0  bar  one  z  1.0
1  bar  two  y  2.0
2  foo  one  x  3.0
3  foo  two  w  4.0

* 参数:`level`仅删除索引的一部分

In [114]:
data = pd.DataFrame({'a':['bar','bar','foo','foo'],'b':['one','two','one','two'],\
                     'c':['z','y','x','w'], 'd':[1.0,2.0,3.0,4.0]})
frame = data.set_index('c',drop=False)  #设置列索引为'c',但是不删除'c'列(保留列)
frame = frame.set_index(['a','b'],append=True)  #在索引为'c'的基础上(保留原索引)，添加索引'a','b',
frame

           c    d
c a   b
z bar one  z  1.0
y bar two  y  2.0
x foo one  x  3.0
w foo two  w  4.0

In [115]:
frame.reset_index(level=1) #删除一部分索引('a')

         a  c    d
c b
z one  bar  z  1.0
y two  bar  y  2.0
x one  foo  x  3.0
w two  foo  w  4.0

* 参数:``drop``丢弃索引，而不是将索引值放在DataFrame的列中

In [116]:
frame.reset_index(level=1,drop=True)

       c    d
c b
z one  z  1.0
y two  y  2.0
x one  x  3.0
w two  w  4.0

### 添加一个 hoc索引

> 如果自己创建索引，则可以将其分配给index字段：

In [ ]:
# data.index = index

## 返回视图与副本

In [117]:
dfmi = pd.DataFrame([list('abcd'),
                      list('efgh'),
                      list('ijkl'),
                      list('mnop')],
                     columns=pd.MultiIndex.from_product([['one', 'two'],
                                                         ['first', 'second']]))
dfmi

    one          two
  first second first second
0     a      b     c      d
1     e      f     g      h
2     i      j     k      l
3     m      n     o      p

In [118]:
# 方法一 ： 链式索引
dfmi['one']['second']
# 方法二
dfmi.loc[:,('one','second')]  # pandas将其作为单个实体来处理
                                # 此外，这种操作顺序可以明显更快，并允许对两个轴进行索引

0    b
1    f
2    j
3    n
Name: second, dtype: object

In [122]:
'''
# 第二种处理方式
dfmi.loc[:, ('one', 'second')] = value
# becomes
dfmi.loc.__setitem__((slice(None), ('one', 'second')), value)

# 第一种处理方式
dfmi['one']['second'] = value
# becomes
dfmi.__getitem__('one').__setitem__('second', value)  #__getitem__:很难预测它是否会返回一个视图或一个副本（取决于数组的内存布局)

'''

"\n# 第二种处理方式\ndfmi.loc[:, ('one', 'second')] = value\n# becomes\ndfmi.loc.__setitem__((slice(None), ('one', 'second')), value)\n\n# 第一种处理方式\ndfmi['one']['second'] = value\n# becomes\ndfmi.__getitem__('one').__setitem__('second', value)  #__getitem__:很难预测它是否会返回一个视图或一个副本（取决于数组的内存布局)\n\n"

> `SettingWithCopyWarning`:使用链式索引时，索引操作的顺序和类型会部分确定结果是原始对象的切片还是切片的副本。

* 希望pandas或多或少地**信任链接索引表达式的赋值**，则可以将选项 设置`mode.chained_assignment`为以下值之一：
    * `warn`，默认值表示SettingWithCopyWarning打印。
    * `raise` 意味着大Pandas会提出SettingWithCopyException 你必须处理的事情。
    * `None` 将完全压制警告。

In [124]:
dfb = pd.DataFrame({'a': ['one', 'one', 'two',
                           'three', 'two', 'one', 'six'],
                     'c': np.arange(7)})
 
dfb
# This will show the SettingWithCopyWarning
# but the frame values will be set
dfb['c'][dfb.a.str.startswith('o')] = 42
dfb

       a  c
0    one  0
1    one  1
2    two  2
3  three  3
4    two  4
5    one  5
6    six  6

<ipython-input-124-1f7efe52d1f9>:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfb['c'][dfb.a.str.startswith('o')] = 42

       a   c
0    one  42
1    one  42
2    two   2
3  three   3
4    two   4
5    one  42
6    six   6

* 然而，这是在副本上运行，不起作用。

In [127]:
pd.set_option('mode.chained_assignment','warn')
dfb[dfb.a.str.startswith('o')]['c'] = 42 
dfb

<ipython-input-127-d93de8566788>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfb[dfb.a.str.startswith('o')]['c'] = 42

       a   c
0    one  42
1    one  42
2    two   2
3  three   3
4    two   4
5    one  42
6    six   6

> **note**:链式分配警告/异常,旨在通知用户可能无效的分配。可能存在误报; 无意中报告链式作业的情况。

## 选择随机样本

> 使用``sample()``方法随机选择Series或DataFrame中的行或列

## 例子

In [37]:
df = pd.DataFrame({'id':np.random.randint(20,size=8),
                  '业务线':['优享','快车优享','快车','D1','D1','优享','快车优享','快车'],
                   'T-2':np.random.randn(8),
                    'T-1':np.random.randn(8)})
df

   id   业务线       T-2       T-1
0   3    优享  1.395021 -0.875840
1   4  快车优享 -0.420090 -0.549379
2  10    快车  0.181340  0.686290
3  14    D1  0.610440 -1.782139
4  19    D1 -0.503651 -0.102540
5   5    优享  1.717062 -0.522773
6   6  快车优享 -0.867238 -0.417188
7  17    快车 -0.189834  0.179039

In [57]:
df2 = df.copy()
df2

   id   业务线       T-2       T-1
0   3    优享  1.395021 -0.875840
1   4  快车优享 -0.420090 -0.549379
2  10    快车  0.181340  0.686290
3  14    D1  0.610440 -1.782139
4  19    D1 -0.503651 -0.102540
5   5    优享  1.717062 -0.522773
6   6  快车优享 -0.867238 -0.417188
7  17    快车 -0.189834  0.179039

In [39]:
df2['业务线'] = df['业务线'].apply(lambda x: '优享' if x in ['优享','快车优享'] else '快车')
df2

   id 业务线       T-2       T-1
0   3  优享  1.395021 -0.875840
1   4  优享 -0.420090 -0.549379
2  10  快车  0.181340  0.686290
3  14  快车  0.610440 -1.782139
4  19  快车 -0.503651 -0.102540
5   5  优享  1.717062 -0.522773
6   6  优享 -0.867238 -0.417188
7  17  快车 -0.189834  0.179039

In [ ]:
# 处理一列数据，判断是否在某个列表中

> apply在调用函数时，默认将DataFrame逐行或逐列作为一个参数代入调用的函数中，但有的函数需要多个参数，这时可以在apply里加上args=，将其他参数组成一个元组代入函数中。
* 但有个前提：
    * 被调用的函数第一个参数必须是DataFrame的行或列
    * args=的元组中参数位置必须和函数定义的参数位置一致

In [27]:
raw_columns = [col for col in df.columns if col.startswith('T')]
raw_columns

check_columns = list(map(lambda x:x + '_check', raw_columns))
check_columns

['T-2', 'T-1']

['T-2_check', 'T-1_check']

In [81]:
'''
def func(column,column):
    global df
    if column == 'T-2':
        return df[column].where(lambda x: x>0, 'T-2不合格')
    elif column == 'T-1':
        return df[column].where(lambda x: x>0, 'T-1不合格')
'''

In [98]:
# 不会用
def func(column, df=df):
    if column == 'T-2':
        return df[column].where(lambda x: x>0, 'T-2不合格')
    elif column == 'T-1':
        return df[column].where(lambda x: x>0, 'T-1不合格')
    
for i in range(len(raw_columns)):
    df2[check_columns[i]] =  func(raw_columns[i], df2)

df2

   id 业务线       T-2       T-1 T-2_check T-1_check
0   3  优享  1.395021 -0.875840   1.39502    T-1不合格
1   4  优享 -0.420090 -0.549379    T-2不合格    T-1不合格
2  10  10  0.181340  0.686290   0.18134   0.68629
3  14  优享  0.610440 -1.782139   0.61044    T-1不合格
4  19  优享 -0.503651 -0.102540    T-2不合格    T-1不合格
5   5  优享  1.717062 -0.522773   1.71706    T-1不合格
6   6  优享 -0.867238 -0.417188    T-2不合格    T-1不合格
7  17  17 -0.189834  0.179039    T-2不合格  0.179039

In [ ]:
help()

In [131]:
def check_value(value, column):
    if column == 'T-2':
        return 'T-2不合格' if value<0 else ''
    elif column == 'T-1':
        return 'T-1不合格' if value<0 else ''
    
df4 = df.copy()
for i in range(len(raw_columns)):
    df4[check_columns[i]] = df4[raw_columns[i]].apply(check_value,args = (raw_columns[i],))

In [132]:
df4

   id   业务线       T-2       T-1 T-2_check T-1_check
0   3    优享  1.395021 -0.875840              T-1不合格
1   4  快车优享 -0.420090 -0.549379    T-2不合格    T-1不合格
2  10    快车  0.181340  0.686290
3  14    D1  0.610440 -1.782139              T-1不合格
4  19    D1 -0.503651 -0.102540    T-2不合格    T-1不合格
5   5    优享  1.717062 -0.522773              T-1不合格
6   6  快车优享 -0.867238 -0.417188    T-2不合格    T-1不合格
7  17    快车 -0.189834  0.179039    T-2不合格

In [146]:
df4[raw_columns]

        T-2       T-1
0  1.395021 -0.875840
1 -0.420090 -0.549379
2  0.181340  0.686290
3  0.610440 -1.782139
4 -0.503651 -0.102540
5  1.717062 -0.522773
6 -0.867238 -0.417188
7 -0.189834  0.179039

In [149]:
df4['T-2_check'],df4['T-1_check']

(0
 1    T-2不合格
 2
 3
 4    T-2不合格
 5
 6    T-2不合格
 7    T-2不合格
 Name: T-2_check, dtype: object, 0    T-1不合格
 1    T-1不合格
 2
 3    T-1不合格
 4    T-1不合格
 5    T-1不合格
 6    T-1不合格
 7
 Name: T-1_check, dtype: object)

In [ ]:
# ts = pd.Series(df['Value'].values, index=df['Date'])

In [163]:
df4['reason'] = df4['T-2_check'].str.cat(df4['T-1_check'],sep=' ')   #将多列连接起来
df4['reason'] = df4['reason'].apply(lambda x: x.strip(' '))
df4['reason'] = df4['reason'].apply(lambda x: x.replace(' ',','))
df4['reason']

0           T-1不合格
1    T-2不合格,T-1不合格
2
3           T-1不合格
4    T-2不合格,T-1不合格
5           T-1不合格
6    T-2不合格,T-1不合格
7           T-2不合格
Name: reason, dtype: object

In [104]:
# 不会用
'''
df3 = df.copy()
df3[check_columns] = df3.apply(map(func, raw_columns))

df3
'''

TypeError: ("'map' object is not callable", 'occurred at index id')

In [90]:
df3.columns

Index(['id', '业务线', 'T-2', 'T-1'], dtype='object')

In [68]:
df2[check_columns] = df2[raw_columns].applymap(func)  # applymap时作用在每一个元素上  apply作用在一列或一行上

   id 业务线       T-2       T-1 T-2_check T-1_check
0   3  优享  1.395021 -0.875840      None      None
1   4  优享 -0.420090 -0.549379      None      None
2  10  10  0.181340  0.686290      None      None
3  14  优享  0.610440 -1.782139      None      None
4  19  优享 -0.503651 -0.102540      None      None
5   5  优享  1.717062 -0.522773      None      None
6   6  优享 -0.867238 -0.417188      None      None
7  17  17 -0.189834  0.179039      None      None

In [76]:
df2[raw_columns].applymap(lambda x: x*10)

         T-2        T-1
0  13.950214  -8.758400
1  -4.200903  -5.493792
2   1.813404   6.862899
3   6.104401 -17.821390
4  -5.036514  -1.025395
5  17.170623  -5.227726
6  -8.672378  -4.171877
7  -1.898337   1.790387

In [69]:
df2[raw_columns]

        T-2       T-1
0  1.395021 -0.875840
1 -0.420090 -0.549379
2  0.181340  0.686290
3  0.610440 -1.782139
4 -0.503651 -0.102540
5  1.717062 -0.522773
6 -0.867238 -0.417188
7 -0.189834  0.179039

In [66]:
a = df['T-2']
func('T-2')

0    1.39502
1     T-2不合格
2    0.18134
3    0.61044
4     T-2不合格
5    1.71706
6     T-2不合格
7     T-2不合格
Name: T-2, dtype: object

In [62]:
df2 = df.copy()
df2
'''
# 第一次处理的结果会被覆盖
df2['业务线'] = df.where(lambda x: x['业务线'].isin(['优享','快车优享']),'快车' )
df2['业务线'] = df.where(lambda x: x['业务线'].isin(['快车']),'优享')
'''
df2

   id   业务线       T-2       T-1
0   3    优享  1.395021 -0.875840
1   4  快车优享 -0.420090 -0.549379
2  10    快车  0.181340  0.686290
3  14    D1  0.610440 -1.782139
4  19    D1 -0.503651 -0.102540
5   5    优享  1.717062 -0.522773
6   6  快车优享 -0.867238 -0.417188
7  17    快车 -0.189834  0.179039

   id 业务线       T-2       T-1
0   3  优享  1.395021 -0.875840
1   4  优享 -0.420090 -0.549379
2  10  10  0.181340  0.686290
3  14  优享  0.610440 -1.782139
4  19  优享 -0.503651 -0.102540
5   5  优享  1.717062 -0.522773
6   6  优享 -0.867238 -0.417188
7  17  17 -0.189834  0.179039

In [51]:
m = df2['业务线'].isin(['优享','快车优享'])
m

0     True
1     True
2    False
3    False
4    False
5     True
6     True
7    False
Name: 业务线, dtype: bool

# 多索引和高级索引

# 合并、联接和连接

## concatenating方法

* ``concat()``:沿着一个轴连接，其他轴执行索引的可选集合逻辑（并集或交集）
    * 沿着一个轴连接
    * 在其他轴上执行操作(e.g 交集、并集)

In [2]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

In [3]:
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

In [4]:
df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [7]:
df1
df2
df3

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [10]:
frames = [df1, df2, df3]
result = pd.concat(frames,axis=0)  # 沿着纵向的轴连接
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

> concat参数

``pd.concat(
    objs,
    axis=0,
    join="outer",
    ignore_index=False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity=False,
    copy=True,
)``

* ``keys`` 用特定的键，将原来的Dataframe标记

In [9]:
result = pd.concat(frames, keys=["x", "y", "z"])  # x/y/z索引，分别关联df1/df2/df3
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

> **Note** 使用`concat()`（`append()`）挥会生成数据的完整副本，因此会对性能产生重大影响
* 如果需要对多个数据集进行修改，先使用列表操作,如下:

In [ ]:
'''
frames = [ process_your_file(f) for f in files ]
result = pd.concat(frames)
'''

### 在其他轴上设置逻辑

> 在处理多个Dataframe时，按一条轴连接，其他州轴有两种方式进行处理，: `join='outer'`, `join='innner'`

* ``join='outer'``(默认选项，将导致零丢失)，取并集

In [14]:
df4 = pd.DataFrame(
    {
        "B": ["B2", "B3", "B6", "B7"],
        "D": ["D2", "D3", "D6", "D7"],
        "F": ["F2", "F3", "F6", "F7"],
    },
    index=[2, 3, 6, 7],
)

In [15]:
df1
df4

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [13]:
result = pd.concat([df1, df4], axis=1)   # axis=1,选取横轴进行连接  
                                        # 纵轴进行处理，默认 join='outer'
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [18]:
# join='outer'的默认行为是对其他轴（本例中为列）进行排序。
# 在pandas的未来版本中，默认设置为不排序。我们指定sort=False来选择现在的新行为。

result = pd.concat([df1, df4], axis=1, sort=False)
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

* ``join='inner'``, 取交集

In [156]:
result = pd.concat([df1, df4], axis=1,join='inner')  
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

> 使用原始DataFrame的索引

In [21]:
result = pd.concat([df1, df4], axis=1,join='inner').reindex(df1.index)
result

     A    B    C    D    B    D    F
0  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3

In [22]:
result = pd.concat([df1, df4], axis=1,join='outer').reindex(df1.index) 
result

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

### `append()`

#### concat的快捷方法

* append()方法是concat()的快捷方法
* 早于concat()方法，沿着axis=0连接(即沿着索引连接)
* 与列表的append()方法不同【在原列表中追加数据】，这里的append方法**返回副本**

In [161]:
result = df1.append(df2)
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

* 对于`DataFrame`，索引必须不相交，但列不是

In [23]:
df1
df4

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [26]:
result = df1.append(df4)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

* append可以连接**多个对象**

In [28]:
result = df1.append([df2,df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### 添加行

> `append`：效率不高（必须创建新对象），但可以传递-- Series/dict --> DataFrame

* 传递Series（`ignore_index`放弃原索引）

In [73]:
s2 = pd.Series(['X0', 'X1', 'X2', 'X3'], index=['A', 'B', 'C', 'D'])
result = df1.append(s2, ignore_index=True)
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  X0  X1  X2  X3

* 传递 a lists of dicts or Series

In [79]:
dicts = [{'A':1, 'B':2, 'C':3, 'X':4},
        {'A':5, 'B':6, 'C':7, 'Y':8}]

df1.append(dicts, ignore_index=True, sort=False)

    A   B   C    D    X    Y
0  A0  B0  C0   D0  NaN  NaN
1  A1  B1  C1   D1  NaN  NaN
2  A2  B2  C2   D2  NaN  NaN
3  A3  B3  C3   D3  NaN  NaN
4   1   2   3  NaN  4.0  NaN
5   5   6   7  NaN  NaN  8.0

### 忽略连接轴的索引

> `ignore_index`：忽略连接后无意义的索引
* 对`concat()` `append()`都适用

In [30]:
df1
df4

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [33]:
result = pd.concat([df1, df4], ignore_index=True, sort=False)  # sort=False不排序
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [34]:
result = df1.append(df4, ignore_index=True, sort=False) 
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

### 连接混合ndims

In [35]:
s1 = pd.Series(['X0', 'X1', 'X2', 'X3'], name='X')

In [36]:
df1
s1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

0    X0
1    X1
2    X2
3    X3
Name: X, dtype: object

In [38]:
result = pd.concat([df1, s1],axis=1)
result

    A   B   C   D   X
0  A0  B0  C0  D0  X0
1  A1  B1  C1  D1  X1
2  A2  B2  C2  D2  X2
3  A3  B3  C3  D3  X3

* `DataFrame.assign(**kwargs)`：在df中添加新列 ，可以实现同样的结果
    * **kwargs**表示关键字参数，它是一个dict
        * 区别***args**表示任何多个无名参数，它是一个tuple

In [43]:
df1.assign(x=s1)

    A   B   C   D   x
0  A0  B0  C0  D0  X0
1  A1  B1  C1  D1  X1
2  A2  B2  C2  D2  X2
3  A3  B3  C3  D3  X3

In [46]:
df1.assign(x=s1,y=s1)

    A   B   C   D   x   y
0  A0  B0  C0  D0  X0  X0
1  A1  B1  C1  D1  X1  X1
2  A2  B2  C2  D2  X2  X2
3  A3  B3  C3  D3  X3  X3

* 添加任意数量的pandas objects(Series/DataFrame), 使用`concat`更好

In [48]:
s2 = pd.Series(['_0','_1','_2','_3'])

In [49]:
df1
s2

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

0    _0
1    _1
2    _2
3    _3
dtype: object

In [50]:
pd.concat([df1,s2,s2,s2],axis=1)

    A   B   C   D   0   1   2
0  A0  B0  C0  D0  _0  _0  _0
1  A1  B1  C1  D1  _1  _1  _1
2  A2  B2  C2  D2  _2  _2  _2
3  A3  B3  C3  D3  _3  _3  _3

* 传递`ignore_index`，删除所有连接轴的名称引用

In [51]:
pd.concat([df1,s2,s2,s2],axis=1, ignore_index=True)

    0   1   2   3   4   5   6
0  A0  B0  C0  D0  _0  _0  _0
1  A1  B1  C1  D1  _1  _1  _1
2  A2  B2  C2  D2  _2  _2  _2
3  A3  B3  C3  D3  _3  _3  _3

### 使用`keys()`进行连接

In [52]:
s3 = pd.Series([0, 1, 2, 3], name='foo')
s4 = pd.Series([0, 1, 2, 3])
s5 = pd.Series([0, 1, 4, 5])

In [54]:
pd.concat([s3, s4, s5], axis=1)

   foo  0  1
0    0  0  0
1    1  1  1
2    2  2  4
3    3  3  5

> 使用`keys`: 重写列名

In [55]:
pd.concat([s3, s4, s5], axis=1, keys=['red', 'blue', 'yellow'])

   red  blue  yellow
0    0     0       0
1    1     1       1
2    2     2       4
3    3     3       5

In [64]:
# frames=[df1,df2,df3]
pd.concat(frames, keys=['x', 'y', 'z'])  #keys将原DataFrame标记

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

* 传入dict给`contact`，这种情况下，dict将被用作`keys`的功能【除非指定了其他键】

In [65]:
pieces = {'x':df1, 'y':df2, 'z':df3}
result = pd.concat(pieces)
result
#指定了其他键
result = pd.concat(pieces, keys=['z','y'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

        A    B    C    D
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7

> 根据传递的键keys和原DataFrame的索引index，会构造出多重所索引

In [67]:
result.index.levels   # 根据keys和index构造的多重索引

FrozenList([['z', 'y'], [4, 5, 6, 7, 8, 9, 10, 11]])

* 使用`levels`：修改索引的级别

In [71]:
result = pd.concat(pieces, keys=['x', 'y', 'z'],
                    levels=[['z', 'y', 'x', 'w']],
                    names=['group_key'])
result
result.index.levels

                A    B    C    D
group_key
x         0    A0   B0   C0   D0
          1    A1   B1   C1   D1
          2    A2   B2   C2   D2
          3    A3   B3   C3   D3
y         4    A4   B4   C4   D4
          5    A5   B5   C5   D5
          6    A6   B6   C6   D6
          7    A7   B7   C7   D7
z         8    A8   B8   C8   D8
          9    A9   B9   C9   D9
          10  A10  B10  C10  D10
          11  A11  B11  C11  D11

FrozenList([['z', 'y', 'x', 'w'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])

## `joining`/`merging` (database-style)

> `merge`: 根据column/index连接

> `join`：只在**idex-on-index** / **column(s)-on-index**上连接

In [ ]:
'''
pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=True,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)
         '''

### merge方法简介

|Merge method|SQL |Join Name	Description|
|-|-|-|
|left|LEFT OUTER JOIN|Use keys from left frame only|
|right|RIGHT OUTER JOIN|Use keys from right frame only|
|outer|FULL OUTER JOIN|Use union of keys from both frames|
|inner(defult)|INNER JOIN|Use intersection of keys from both frames|

> **多对多链连接(joining `columns on columns`)**: DataFrame上的索引index将被丢弃

In [86]:
# one_to_on 1:1
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})
left
right
pd.merge(left, right, on='key')

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [89]:
# one_to_many  1:m
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                      'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                       'key2': ['K0', 'K0', 'K0', 'K0'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})
left
right
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [92]:
pd.merge(left, right, how='left', on=['key1', 'key2'])
pd.merge(left, right, how='right', on=['key1', 'key2'])
pd.merge(left, right, how='outer', on=['key1', 'key2'])
pd.merge(left, right, how='inner', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [95]:
# join keys存在重复
# many_to_many m:m
left = pd.DataFrame({'A': [1, 2], 'B': [2, 2]})
right = pd.DataFrame({'A': [4, 5, 6], 'B': [2, 2, 2]})
left
right
pd.merge(left, right, on='B', how='outer')

   A  B
0  1  2
1  2  2

   A  B
0  4  2
1  5  2
2  6  2

   A_x  B  A_y
0    1  2    4
1    1  2    5
2    1  2    6
3    2  2    4
4    2  2    5
5    2  2    6

* **warning**:在重复键duplicate keys上join/merge可能会导致内存溢出（返回的frame是multipication of row dimensions行维度的乘法）
    * solve: 在join之前，处理好keys中的重复值

#### validate:检查重复的keys

> 参数`validate`：检查合并的keys中是否存在意外的重复项

In [99]:
left = pd.DataFrame({'A' : [1,2], 'B' : [1, 2]})
right = pd.DataFrame({'A' : [4,5,6], 'B': [2, 2, 2]})  # B中有重复的key value
left
right

   A  B
0  1  1
1  2  2

   A  B
0  4  2
1  5  2
2  6  2

In [101]:
# 使用validate检查是否符合one_to_one连接
# pd.merge(left, right, on ='B', how='outer', validate='one_to_one')
# 报错 MergeError:Merge keys are not unique in right dataset; not a one-to-one merge

In [102]:
# 使用validate检查是否符合one_to_many连接
pd.merge(left, right, on='B', how='outer', validate="one_to_many")

   A_x  B  A_y
0    1  1  NaN
1    2  2  4.0
2    2  2  5.0
3    2  2  6.0

#### indicator：_merge value

|Observation Origin|merge value|
|-|-|
|Merge key only in 'left' frame|left_only|
|Merge key only in 'right' frame|right_only|
|Merge key in both frames|both|

In [106]:
df1 = pd.DataFrame({'col1': [0, 1], 'col_left': ['a', 'b']})
df2 = pd.DataFrame({'col1': [1, 2, 2], 'col_right': [2, 2, 2]})
df1
df2

   col1 col_left
0     0        a
1     1        b

   col1  col_right
0     1          2
1     2          2
2     2          2

In [107]:
pd.merge(df1, df2, on='col1', how='outer', indicator=True)

   col1 col_left  col_right      _merge
0     0        a        NaN   left_only
1     1        b        2.0        both
2     2      NaN        2.0  right_only
3     2      NaN        2.0  right_only

* 接受**字符串参数** --> 作为indicator column name

In [109]:
pd.merge(df1, df2, on='col1', how='outer', indicator='indicator_column')

   col1 col_left  col_right indicator_column
0     0        a        NaN        left_only
1     1        b        2.0             both
2     2      NaN        2.0       right_only
3     2      NaN        2.0       right_only

#### merge dtypes

* merge会保留join key的数据类型

In [110]:
left = pd.DataFrame({'key': [1], 'v1': [10]})
left
right = pd.DataFrame({'key': [1, 2], 'v1': [20, 30]})
right

   key  v1
0    1  10

   key  v1
0    1  20
1    2  30

In [112]:
pd.merge(left, right, how='outer')
pd.merge(left, right, how='outer').dtypes

   key  v1
0    1  10
1    1  20
2    2  30

key    int64
v1     int64
dtype: object

* 如果缺少引入的值，则生成的数据类型将向上转换。

In [113]:
pd.merge(left, right, how='outer', on='key')
pd.merge(left, right, how='outer', on='key').dtypes

   key  v1_x  v1_y
0    1  10.0    20
1    2   NaN    30

key       int64
v1_x    float64
v1_y      int64
dtype: object

* merge保留`category`类别的数据类型

In [115]:
from pandas.api.types import CategoricalDtype
X = pd.Series(np.random.choice(['foo', 'bar'], size=(10,)))
X =X.astype(CategoricalDtype(categories=['foo', 'bar']))

left = pd.DataFrame({'X': X,
                      'Y': np.random.choice(['one', 'two', 'three'],
                                            size=(10,))})
left
left.dtypes

     X      Y
0  bar    two
1  foo    two
2  bar  three
3  bar    two
4  bar  three
5  bar  three
6  foo    two
7  bar    two
8  bar  three
9  foo    one

X    category
Y      object
dtype: object

### `join`: 根据index(row labels)对齐

In [116]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                       'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
left
right

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [120]:
left.join(right)
left.join(right, how='outer')
left.join(right, how='inner')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [125]:
# same behaviour by using merge
pd.merge(left, right, how='outer', left_index=True, right_index=True)
pd.merge(left, right, how='inner', left_index=True, right_index=True)

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

#### join **key columns** on an **index**

In [ ]:
'''
left.join(right, on=key_or_keys)
pd.merge(left, right, left_on=key_or_keys, right_index=True,
      how='left', sort=False)
      '''

# Pandas库的数据类型运算

### 算术运算法则

* 算术运算根据行列索引，补齐后运算，运算默认产生浮点数
* 补齐时缺项填充NaN(空值)
* 二维和一维、一维和零维间为广播运算
* 采用+ - * /符号进行的二元运算产生新的对象

### 数据类型的算术运算

In [ ]:
a=pd.DataFrame(np.arange(12).reshape(3,4))
b=pd.DataFrame(np.arange(20).reshape(4,5))
print(a)
print(b)
print('\n')

print(a+b)
print('\n')

print(a*b)

* 方法形式的运算

|方法|说明|
|-|-|
|.add(d.**argws|类型间加法运算，可选参数|
|.sub|类型间减法运算，可选参数|
|.mul(d.**argws)|类型间乘法运算，可选参数|
|.div(d,**argws)|类型间除法运算，可选参数|

In [ ]:
b.add(a,fill_value=100)
a.mul(b,fill_value=0)    
print(a)                       #fill_value参数代替NaN,替代后参运算
print(b)

In [ ]:
c=pd.Series(np.arange(4))
print(c)
c-10

In [ ]:
print(b)
b-c   #不同维度间为广播运算，一维Sereis默认在轴1参与运算

In [ ]:
b.sub(c,axis=0)  #使用运算方法可以令一维Sereis参与轴0运算

### 比较运算法则

* 比较运算只能比较相同索引的元素，不进行补齐
* 二维和一维、一维和零维间为广播运算
* 采用> <= < = == !=等符号进行的二元运算产生布尔对象

### 数据类型的比较运算

In [ ]:
a=pd.DataFrame(np.arange(12).reshape(3,4))
b=pd.DataFrame(np.arange(12,0,-1).reshape(3,4))
print(a)
print(b)
print(a>b)
print(a == b)      #同维度运算，尺寸一致

In [ ]:
c=pd.Series(np.arange(5))   #不同维度，广播运算，默认在0轴
print(a)
print(c)
print(a>c)
print(c>0)

# 样式

In [10]:
df = pd.DataFrame({'A':np.linspace(1,10,10)})
df = pd.concat([df,pd.DataFrame(np.random.randn(10,4),columns=list('BCDE'))],axis=1)
df

      A         B         C         D         E
0   1.0  0.616431  0.695706 -0.360069 -1.069060
1   2.0  0.919854 -0.806581 -2.594430  0.344745
2   3.0  0.043445 -0.156345 -1.567735  1.013450
3   4.0 -0.658254  1.736948  0.090061  1.325343
4   5.0  0.235008 -0.063942  1.166515  0.407517
5   6.0  0.754386 -1.033380 -0.532687 -0.050618
6   7.0  0.399053 -0.497103  0.106767 -0.282957
7   8.0  1.239746 -0.879073  0.245760 -0.715180
8   9.0  1.227936 -1.103239 -0.539229  1.416926
9  10.0  0.211718  0.140327  1.032987  1.579302

In [12]:
# 负数标红
def color_negative_red(val):
    '''
    the css property 'color: red' for negative
    '''
    color = 'red' if val < 0 else 'black'
    return 'color: %s' % color

a = df.style.applymap(color_negative_red)
a

In [13]:
type(a)

pandas.io.formats.style.Styler

In [16]:
wb = Workbook()

In [70]:
# 报错：'Styler' object has no attribute '_data'
'''
from openpyxl import Workbook
from openpyxl.utils.dataframe import dataframe_to_rows

wb = Workbook()
ws = wb.active

for r in dataframe_to_rows(a):
    ws.append(r)
wb.save('aaaaa.xlsx')
'''

"\nfrom openpyxl import Workbook\nfrom openpyxl.utils.dataframe import dataframe_to_rows\n\nwb = Workbook()\nws = wb.active\n\nfor r in dataframe_to_rows(a):\n    ws.append(r)\nwb.save('aaaaa.xlsx')\n"

# Pandas数据特征分析

**对一组数据的理解**

 一组数据                    基本统计（含排序）
表达一个或多个含义---------> 分布/累计统计
                             数据特征  <相关性、周期性等>
                             数据挖掘（形成知识）

# 数据的排序

* .sort_insex()方法在指定轴上根据**索引**进行排序，默认升序

> .sort_index(axis=0,ascending=True)

In [ ]:
import numpy as np
import pandas as pd
b=pd.DataFrame(np.arange(20).reshape(4,5),index=['c','a','d','b'])
b

In [ ]:
b.sort_index()

In [ ]:
b.sort_index(ascending=False)

> .sort_index(axis=0,ascending=True)

In [ ]:
c=b.sort_index(axis=1,ascending=False)
c

In [ ]:
c=c.sort_index()
c

* sort_values()方法在指定轴上根据**数值**进行排序，默认升序

> Series.sort_values(axis=0,ascending=True)
> DataFrame.sort_values(by,axis=0,ascengding=True)

> *by: axis轴上的某个索引或索引列表*

In [ ]:
b

In [ ]:
c=b.sort_values(2,ascending=False)
c

In [ ]:
c=c.sort_values('a',axis=1,ascending=False)
c

* NaN统一放到排序末尾

In [ ]:
a=pd.DataFrame(np.arange(12).reshape(3,4),index=['a','b','c'])
print(a)
print(b)

In [ ]:
c=a+b
c

In [ ]:
c.sort_values(2,axis=0,ascending=False)

In [ ]:
c.sort_values(2,axis=0,ascending=True)

# 数据的基本统计分析

* 适用于Series和DataFrame类型

|方法|说明|
|--|--|
|.sum()|计算数据的总和，按0轴计算，下同|
|.count()|非NaN值的数量|
|.mean() .median()|计算数据的算术平均值、算术中位数|
|.var() .std()|计算数据的方差、标准差|
|.min() .max()|计算数据的最小值、最大值|

* 适用于Series类型

 |方法|说明|
|--|--|
|.argmin() .argmax()|计算数据最大值、最小值所在位置的索引位置（自动索引）|
|.idxmin() .idxmax()|计算数据最大值、最小值所在位置的索引（自定义索引）|

* 适用于Series和DataFrame类型

|方法|说明|
|--|--|
|.describe()|针对0轴（各列）的统计汇总|

**Series**

In [ ]:
a=pd.Series([9,8,7,6],index=['a','b','c','d'])
a

In [ ]:
a.describe()

In [ ]:
type(a.describe())

In [ ]:
print(a.describe()['max'])
print(a.describe()['25%'])

**DataFrame**

In [ ]:
b=pd.DataFrame(np.arange(20).reshape(4,5),index=['c','a','d','b'])
b

In [ ]:
b.describe()

In [ ]:
type(b.describe())

In [ ]:
print(b.describe().ix['min'])
print('\n')

print(b.describe()[2])

* **约简方法**

    约简方法常用选项

|选项|说明|
|-|-|
|axis |约简的轴.DataFrame的行用0，列用1 |
|skipna |排除缺失值，默认值为True <除非整个切片(这里指行或列)都是NA，否则(该行或列中的)NA值会被自动排除>|
|level |如果行是层次化索引的(即MultiIndex),则根据level分组约简 |

> 调用DataFrame的**sum**方法返回含有**列**的和的Series

In [ ]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],\
                  index=['a','b','c','d'],\
                 columns=['one','two'])
print(df)
print('\n')

df.sum()

In [ ]:
df.sum(axis=1)  #按行进行求和运算

In [ ]:
df.mean(axis='columns')

In [ ]:
df.mean(axis='columns',skipna=False)

> 有些方法（如idxmin和idxmax）返回的是间接统计，比如返回最大值或最小值的索引

In [ ]:
df.idxmax()

In [ ]:
df.idxmax(axis=1)

* **累计型方法**

In [ ]:
print(df)
print('\n')

df.cumsum()

* **汇总统计**

In [ ]:
df.describe()

> 对于**非数值型数据**，describe会产生另外一种汇总统计

In [ ]:
obj = pd.Series(['a','a','b','c']*4)
print(obj)
print('\n')

obj.describe()

# 数据的累计统计分析

In [ ]:
b

* 适用于Series类型和DataFrame类型，累计计算

In [ ]:
b.cumsum()

In [ ]:
b.cummin()

In [ ]:
b.cummax()

In [ ]:
b.cumprod()

* 适用于Series和DataFrame类型，滚动计算（窗口计算）

|方法|说明|
|--|--|
|.rolling(w).sum()|依此计算相邻w个元素的和|
|.rolling(w).mean()|依此计算相邻w个元素的算术平均值|
|.rolling(W).var()|依此计算相邻w个元素的方差|
|.rolling(W).std()|依此计算相邻w个元素的标准差|
|.rolling(w).min()  .max()|依此计算相邻w个元素的最大值和最小值|

In [ ]:
b

In [ ]:
b.rolling(2).sum()

In [ ]:
b.rolling(3).sum()

# 数据的相关分析

* 协方差

>0 x和y正相关
<0 x和y负相关
=0 x和y独立无关

* Pearson相关系数

0.8-1.0 极强相关
0.6-0.8 强相关
0.4-0.6 中等程度相关
0.2-0.4 弱相关
0.0-0.2 极弱相关或无相关

* 相关分析函数

适用于Series类型和DataFrame类型

|方法|说明|
|-|-|
|.cov()|计算协方差矩阵|
|.corr()|计算相关系数矩阵，Pearson、Spearman、Kendall等系数|

* 实例：房价增幅与M2增幅的相关性

In [ ]:
hprice=pd.Series([3.84,22.93,12.75,22.6,12.33]\
                 ,index=['2008','2009','2010','2011','2012'])
m2=pd.Series([8.18,18.38,9.13,7.82,6.69],index=['2008','2009','2010','2011','2012'])
m2.corr(hprice)

In [ ]:
import matplotlib.pyplot as plt
plt.plot(hprice.index,hprice.values)
plt.plot(['2008',2009,2010,2011,2012],[8.18,18.38,9.13,7.82,6.69])
plt.xlabel('年份',fontproperties='SIMHEI',fontsize=20)
plt.show()

# 时间序列/日期

# 时间增量

# collect

In [67]:
help(pd.date_range)

Help on function date_range in module pandas.core.indexes.datetimes:

date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=None, **kwargs)
    Return a fixed frequency DatetimeIndex.

    Parameters
    ----------
    start : str or datetime-like, optional
        Left bound for generating dates.
    end : str or datetime-like, optional
        Right bound for generating dates.
    periods : integer, optional
        Number of periods to generate.
    freq : str or DateOffset, default 'D' (calendar daily)
        Frequency strings can have multiples, e.g. '5H'. See
        :ref:`here <timeseries.offset_aliases>` for a list of
        frequency aliases.
    tz : str or tzinfo, optional
        Time zone name for returning localized DatetimeIndex, for example
        'Asia/Hong_Kong'. By default, the resulting DatetimeIndex is
        timezone-naive.
    normalize : bool, default False
        Normalize start/end dates to midnight before generating date range.
    name : str, default None
        Name of the resulting DatetimeIndex.
    closed : {None, 'left', 'right'}, optional
        Make the interval closed with respect to the given frequency to
        the 'left', 'right', or both sides (None, the default).
    **kwargs
        For compatibility. Has no effect on the result.

    Returns
    -------
    rng : DatetimeIndex

    See Also
    --------
    pandas.DatetimeIndex : An immutable container for datetimes.
    pandas.timedelta_range : Return a fixed frequency TimedeltaIndex.
    pandas.period_range : Return a fixed frequency PeriodIndex.
    pandas.interval_range : Return a fixed frequency IntervalIndex.

    Notes
    -----
    Of the four parameters ``start``, ``end``, ``periods``, and ``freq``,
    exactly three must be specified. If ``freq`` is omitted, the resulting
    ``DatetimeIndex`` will have ``periods`` linearly spaced elements between
    ``start`` and ``end`` (closed on both sides).

    To learn more about the frequency strings, please see `this link
    <http://pandas.pydata.org/pandas-docs/stable/timeseries.html#offset-aliases>`__.

    Examples
    --------
    **Specifying the values**

    The next four examples generate the same `DatetimeIndex`, but vary
    the combination of `start`, `end` and `periods`.

    Specify `start` and `end`, with the default daily frequency.

    >>> pd.date_range(start='1/1/2018', end='1/08/2018')
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start` and `periods`, the number of periods (days).

    >>> pd.date_range(start='1/1/2018', periods=8)
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `end` and `periods`, the number of periods (days).

    >>> pd.date_range(end='1/1/2018', periods=8)
    DatetimeIndex(['2017-12-25', '2017-12-26', '2017-12-27', '2017-12-28',
                   '2017-12-29', '2017-12-30', '2017-12-31', '2018-01-01'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start`, `end`, and `periods`; the frequency is generated
    automatically (linearly spaced).

    >>> pd.date_range(start='2018-04-24', end='2018-04-27', periods=3)
    DatetimeIndex(['2018-04-24 00:00:00', '2018-04-25 12:00:00',
                   '2018-04-27 00:00:00'], freq=None)

    **Other Parameters**

    Changed the `freq` (frequency) to ``'M'`` (month end frequency).

    >>> pd.date_range(start='1/1/2018', periods=5, freq='M')
    DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
                   '2018-05-31'],
                  dtype='datetime64[ns]', freq='M')

    Multiples are allowed

    >>> pd.date_range(start='1/1/2018', periods=5, freq='3M')
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    `freq` can also be specified as an Offset object.

    >>> pd.date_range(start='1/1/2018', periods=5, freq=pd.offsets.MonthEnd(3))
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    Specify `tz` to set the timezone.

    >>> pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')
    DatetimeIndex(['2018-01-01 00:00:00+09:00', '2018-01-02 00:00:00+09:00',
                   '2018-01-03 00:00:00+09:00', '2018-01-04 00:00:00+09:00',
                   '2018-01-05 00:00:00+09:00'],
                  dtype='datetime64[ns, Asia/Tokyo]', freq='D')

    `closed` controls whether to include `start` and `end` that are on the
    boundary. The default includes boundary points on either end.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed=None)
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='left'`` to exclude `end` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='left')
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='right'`` to exclude `start` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='right')
    DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

In [69]:
help( pd.timedelta_range)

Help on function timedelta_range in module pandas.core.indexes.timedeltas:

timedelta_range(start=None, end=None, periods=None, freq=None, name=None, closed=None)
    Return a fixed frequency TimedeltaIndex, with day as the default
    frequency

    Parameters
    ----------
    start : string or timedelta-like, default None
        Left bound for generating timedeltas
    end : string or timedelta-like, default None
        Right bound for generating timedeltas
    periods : integer, default None
        Number of periods to generate
    freq : string or DateOffset, default 'D' (calendar daily)
        Frequency strings can have multiples, e.g. '5H'
    name : string, default None
        Name of the resulting TimedeltaIndex
    closed : string, default None
        Make the interval closed with respect to the given frequency to
        the 'left', 'right', or both sides (None)

    Returns
    -------
    rng : TimedeltaIndex

    Notes
    -----
    Of the four parameters ``start``, ``end``, ``periods``, and ``freq``,
    exactly three must be specified. If ``freq`` is omitted, the resulting
    ``TimedeltaIndex`` will have ``periods`` linearly spaced elements between
    ``start`` and ``end`` (closed on both sides).

    To learn more about the frequency strings, please see `this link
    <http://pandas.pydata.org/pandas-docs/stable/timeseries.html#offset-aliases>`__.

    Examples
    --------

    >>> pd.timedelta_range(start='1 day', periods=4)
    TimedeltaIndex(['1 days', '2 days', '3 days', '4 days'],
                   dtype='timedelta64[ns]', freq='D')

    The ``closed`` parameter specifies which endpoint is included.  The default
    behavior is to include both endpoints.

    >>> pd.timedelta_range(start='1 day', periods=4, closed='right')
    TimedeltaIndex(['2 days', '3 days', '4 days'],
                   dtype='timedelta64[ns]', freq='D')

    The ``freq`` parameter specifies the frequency of the TimedeltaIndex.
    Only fixed frequencies can be passed, non-fixed frequencies such as
    'M' (month end) will raise.

    >>> pd.timedelta_range(start='1 day', end='2 days', freq='6H')
    TimedeltaIndex(['1 days 00:00:00', '1 days 06:00:00', '1 days 12:00:00',
                    '1 days 18:00:00', '2 days 00:00:00'],
                   dtype='timedelta64[ns]', freq='6H')

    Specify ``start``, ``end``, and ``periods``; the frequency is generated
    automatically (linearly spaced).

    >>> pd.timedelta_range(start='1 day', end='5 days', periods=4)
    TimedeltaIndex(['1 days 00:00:00', '2 days 08:00:00', '3 days 16:00:00',
                '5 days 00:00:00'],
               dtype='timedelta64[ns]', freq=None)

In [43]:
help(pd.Index.intersection)

Help on function intersection in module pandas.core.indexes.base:

intersection(self, other, sort=False)
    Form the intersection of two Index objects.

    This returns a new Index with elements common to the index and `other`.

    Parameters
    ----------
    other : Index or array-like
    sort : False or None, default False
        Whether to sort the resulting index.

        * False : do not sort the result.
        * None : sort the result, except when `self` and `other` are equal
          or when the values cannot be compared.

        .. versionadded:: 0.24.0

        .. versionchanged:: 0.24.1

           Changed the default from ``True`` to ``False``, to match
           the behaviour of 0.23.4 and earlier.

    Returns
    -------
    intersection : Index

    Examples
    --------
    >>> idx1 = pd.Index([1, 2, 3, 4])
    >>> idx2 = pd.Index([3, 4, 5, 6])
    >>> idx1.intersection(idx2)
    Int64Index([3, 4], dtype='int64')

In [71]:
help(pd.DataFrame.xs)

Help on function xs in module pandas.core.generic:

xs(self, key, axis=0, level=None, drop_level: 'bool_t' = True)
    Return cross-section from the Series/DataFrame.

    This method takes a `key` argument to select data at a particular
    level of a MultiIndex.

    Parameters
    ----------
    key : label or tuple of label
        Label contained in the index, or partially in a MultiIndex.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Axis to retrieve cross-section on.
    level : object, defaults to first n levels (n=1 or len(key))
        In case of a key partially contained in a MultiIndex, indicate
        which levels are used. Levels can be referred by label or position.
    drop_level : bool, default True
        If False, returns object with same levels as self.

    Returns
    -------
    Series or DataFrame
        Cross-section from the original Series or DataFrame
        corresponding to the selected index levels.

    See Also
    --------
    DataFrame.loc : Access a group of rows and columns
        by label(s) or a boolean array.
    DataFrame.iloc : Purely integer-location based indexing
        for selection by position.

    Notes
    -----
    `xs` can not be used to set values.

    MultiIndex Slicers is a generic way to get/set values on
    any level or levels.
    It is a superset of `xs` functionality, see
    :ref:`MultiIndex Slicers <advanced.mi_slicers>`.

    Examples
    --------
    >>> d = {'num_legs': [4, 4, 2, 2],
    ...      'num_wings': [0, 0, 2, 2],
    ...      'class': ['mammal', 'mammal', 'mammal', 'bird'],
    ...      'animal': ['cat', 'dog', 'bat', 'penguin'],
    ...      'locomotion': ['walks', 'walks', 'flies', 'walks']}
    >>> df = pd.DataFrame(data=d)
    >>> df = df.set_index(['class', 'animal', 'locomotion'])
    >>> df
                               num_legs  num_wings
    class  animal  locomotion
    mammal cat     walks              4          0
           dog     walks              4          0
           bat     flies              2          2
    bird   penguin walks              2          2

    Get values at specified index

    >>> df.xs('mammal')
                       num_legs  num_wings
    animal locomotion
    cat    walks              4          0
    dog    walks              4          0
    bat    flies              2          2

    Get values at several indexes

    >>> df.xs(('mammal', 'dog'))
                num_legs  num_wings
    locomotion
    walks              4          0

    Get values at specified index and level

    >>> df.xs('cat', level=1)
                       num_legs  num_wings
    class  locomotion
    mammal walks              4          0

    Get values at several indexes and levels

    >>> df.xs(('bird', 'walks'),
    ...       level=[0, 'locomotion'])
             num_legs  num_wings
    animal
    penguin         2          2

    Get values at specified column and axis

    >>> df.xs('num_wings', axis=1)
    class   animal   locomotion
    mammal  cat      walks         0
            dog      walks         0
            bat      flies         2
    bird    penguin  walks         2
    Name: num_wings, dtype: int64